/* automatically generated by rust-bindgen 0.72.1 */

#[doc = " Prototype for user allocation function\n @param size the allocation size in bytes\n @param alignment the required alignment, guaranteed to be a power of 2"]
pub type b2AllocFcn = ::std::option::Option<
    unsafe extern "C" fn(size: ::std::os::raw::c_uint, alignment: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_void,
>;
#[doc = " Prototype for user free function\n @param mem the memory previously allocated through `b2AllocFcn`"]
pub type b2FreeFcn = ::std::option::Option<unsafe extern "C" fn(mem: *mut ::std::os::raw::c_void)>;
#[doc = " Prototype for the user assert callback. Return 0 to skip the debugger break."]
pub type b2AssertFcn = ::std::option::Option<
    unsafe extern "C" fn(
        condition: *const ::std::os::raw::c_char,
        fileName: *const ::std::os::raw::c_char,
        lineNumber: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
#[doc = " Version numbering scheme.\n See https://semver.org/"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Version {
    #[doc = " Significant changes"]
    pub major: ::std::os::raw::c_int,
    #[doc = " Incremental changes"]
    pub minor: ::std::os::raw::c_int,
    #[doc = " Bug fixes"]
    pub revision: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Version"][::std::mem::size_of::<b2Version>() - 12usize];
    ["Alignment of b2Version"][::std::mem::align_of::<b2Version>() - 4usize];
    ["Offset of field: b2Version::major"][::std::mem::offset_of!(b2Version, major) - 0usize];
    ["Offset of field: b2Version::minor"][::std::mem::offset_of!(b2Version, minor) - 4usize];
    ["Offset of field: b2Version::revision"][::std::mem::offset_of!(b2Version, revision) - 8usize];
};
#[doc = " 2D vector\n This can be used to represent a point or free vector"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Vec2 {
    #[doc = " coordinates"]
    pub x: f32,
    #[doc = " coordinates"]
    pub y: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Vec2"][::std::mem::size_of::<b2Vec2>() - 8usize];
    ["Alignment of b2Vec2"][::std::mem::align_of::<b2Vec2>() - 4usize];
    ["Offset of field: b2Vec2::x"][::std::mem::offset_of!(b2Vec2, x) - 0usize];
    ["Offset of field: b2Vec2::y"][::std::mem::offset_of!(b2Vec2, y) - 4usize];
};
#[doc = " Cosine and sine pair\n This uses a custom implementation designed for cross-platform determinism"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2CosSin {
    #[doc = " cosine and sine"]
    pub cosine: f32,
    pub sine: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2CosSin"][::std::mem::size_of::<b2CosSin>() - 8usize];
    ["Alignment of b2CosSin"][::std::mem::align_of::<b2CosSin>() - 4usize];
    ["Offset of field: b2CosSin::cosine"][::std::mem::offset_of!(b2CosSin, cosine) - 0usize];
    ["Offset of field: b2CosSin::sine"][::std::mem::offset_of!(b2CosSin, sine) - 4usize];
};
#[doc = " 2D rotation\n This is similar to using a complex number for rotation"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Rot {
    #[doc = " cosine and sine"]
    pub c: f32,
    #[doc = " cosine and sine"]
    pub s: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Rot"][::std::mem::size_of::<b2Rot>() - 8usize];
    ["Alignment of b2Rot"][::std::mem::align_of::<b2Rot>() - 4usize];
    ["Offset of field: b2Rot::c"][::std::mem::offset_of!(b2Rot, c) - 0usize];
    ["Offset of field: b2Rot::s"][::std::mem::offset_of!(b2Rot, s) - 4usize];
};
#[doc = " A 2D rigid transform"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Transform {
    pub p: b2Vec2,
    pub q: b2Rot,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Transform"][::std::mem::size_of::<b2Transform>() - 16usize];
    ["Alignment of b2Transform"][::std::mem::align_of::<b2Transform>() - 4usize];
    ["Offset of field: b2Transform::p"][::std::mem::offset_of!(b2Transform, p) - 0usize];
    ["Offset of field: b2Transform::q"][::std::mem::offset_of!(b2Transform, q) - 8usize];
};
#[doc = " A 2-by-2 Matrix"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Mat22 {
    #[doc = " columns"]
    pub cx: b2Vec2,
    #[doc = " columns"]
    pub cy: b2Vec2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Mat22"][::std::mem::size_of::<b2Mat22>() - 16usize];
    ["Alignment of b2Mat22"][::std::mem::align_of::<b2Mat22>() - 4usize];
    ["Offset of field: b2Mat22::cx"][::std::mem::offset_of!(b2Mat22, cx) - 0usize];
    ["Offset of field: b2Mat22::cy"][::std::mem::offset_of!(b2Mat22, cy) - 8usize];
};
#[doc = " Axis-aligned bounding box"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2AABB {
    pub lowerBound: b2Vec2,
    pub upperBound: b2Vec2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2AABB"][::std::mem::size_of::<b2AABB>() - 16usize];
    ["Alignment of b2AABB"][::std::mem::align_of::<b2AABB>() - 4usize];
    ["Offset of field: b2AABB::lowerBound"][::std::mem::offset_of!(b2AABB, lowerBound) - 0usize];
    ["Offset of field: b2AABB::upperBound"][::std::mem::offset_of!(b2AABB, upperBound) - 8usize];
};
#[doc = " separation = dot(normal, point) - offset"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Plane {
    pub normal: b2Vec2,
    pub offset: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Plane"][::std::mem::size_of::<b2Plane>() - 12usize];
    ["Alignment of b2Plane"][::std::mem::align_of::<b2Plane>() - 4usize];
    ["Offset of field: b2Plane::normal"][::std::mem::offset_of!(b2Plane, normal) - 0usize];
    ["Offset of field: b2Plane::offset"][::std::mem::offset_of!(b2Plane, offset) - 8usize];
};
#[doc = " Low level ray cast input data"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2RayCastInput {
    #[doc = " Start point of the ray cast"]
    pub origin: b2Vec2,
    #[doc = " Translation of the ray cast"]
    pub translation: b2Vec2,
    #[doc = " The maximum fraction of the translation to consider, typically 1"]
    pub maxFraction: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2RayCastInput"][::std::mem::size_of::<b2RayCastInput>() - 20usize];
    ["Alignment of b2RayCastInput"][::std::mem::align_of::<b2RayCastInput>() - 4usize];
    ["Offset of field: b2RayCastInput::origin"][::std::mem::offset_of!(b2RayCastInput, origin) - 0usize];
    ["Offset of field: b2RayCastInput::translation"][::std::mem::offset_of!(b2RayCastInput, translation) - 8usize];
    ["Offset of field: b2RayCastInput::maxFraction"][::std::mem::offset_of!(b2RayCastInput, maxFraction) - 16usize];
};
#[doc = " A distance proxy is used by the GJK algorithm. It encapsulates any shape.\n You can provide between 1 and B2_MAX_POLYGON_VERTICES and a radius."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ShapeProxy {
    #[doc = " The point cloud"]
    pub points: [b2Vec2; 8usize],
    #[doc = " The number of points. Must be greater than 0."]
    pub count: ::std::os::raw::c_int,
    #[doc = " The external radius of the point cloud. May be zero."]
    pub radius: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ShapeProxy"][::std::mem::size_of::<b2ShapeProxy>() - 72usize];
    ["Alignment of b2ShapeProxy"][::std::mem::align_of::<b2ShapeProxy>() - 4usize];
    ["Offset of field: b2ShapeProxy::points"][::std::mem::offset_of!(b2ShapeProxy, points) - 0usize];
    ["Offset of field: b2ShapeProxy::count"][::std::mem::offset_of!(b2ShapeProxy, count) - 64usize];
    ["Offset of field: b2ShapeProxy::radius"][::std::mem::offset_of!(b2ShapeProxy, radius) - 68usize];
};
#[doc = " Low level shape cast input in generic form. This allows casting an arbitrary point\n cloud wrap with a radius. For example, a circle is a single point with a non-zero radius.\n A capsule is two points with a non-zero radius. A box is four points with a zero radius."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ShapeCastInput {
    #[doc = " A generic shape"]
    pub proxy: b2ShapeProxy,
    #[doc = " The translation of the shape cast"]
    pub translation: b2Vec2,
    #[doc = " The maximum fraction of the translation to consider, typically 1"]
    pub maxFraction: f32,
    #[doc = " Allow shape cast to encroach when initially touching. This only works if the radius is greater than zero."]
    pub canEncroach: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ShapeCastInput"][::std::mem::size_of::<b2ShapeCastInput>() - 88usize];
    ["Alignment of b2ShapeCastInput"][::std::mem::align_of::<b2ShapeCastInput>() - 4usize];
    ["Offset of field: b2ShapeCastInput::proxy"][::std::mem::offset_of!(b2ShapeCastInput, proxy) - 0usize];
    ["Offset of field: b2ShapeCastInput::translation"][::std::mem::offset_of!(b2ShapeCastInput, translation) - 72usize];
    ["Offset of field: b2ShapeCastInput::maxFraction"][::std::mem::offset_of!(b2ShapeCastInput, maxFraction) - 80usize];
    ["Offset of field: b2ShapeCastInput::canEncroach"][::std::mem::offset_of!(b2ShapeCastInput, canEncroach) - 84usize];
};
#[doc = " Low level ray cast or shape-cast output data. Returns a zero fraction and normal in the case of initial overlap."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2CastOutput {
    #[doc = " The surface normal at the hit point"]
    pub normal: b2Vec2,
    #[doc = " The surface hit point"]
    pub point: b2Vec2,
    #[doc = " The fraction of the input translation at collision"]
    pub fraction: f32,
    #[doc = " The number of iterations used"]
    pub iterations: ::std::os::raw::c_int,
    #[doc = " Did the cast hit?"]
    pub hit: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2CastOutput"][::std::mem::size_of::<b2CastOutput>() - 28usize];
    ["Alignment of b2CastOutput"][::std::mem::align_of::<b2CastOutput>() - 4usize];
    ["Offset of field: b2CastOutput::normal"][::std::mem::offset_of!(b2CastOutput, normal) - 0usize];
    ["Offset of field: b2CastOutput::point"][::std::mem::offset_of!(b2CastOutput, point) - 8usize];
    ["Offset of field: b2CastOutput::fraction"][::std::mem::offset_of!(b2CastOutput, fraction) - 16usize];
    ["Offset of field: b2CastOutput::iterations"][::std::mem::offset_of!(b2CastOutput, iterations) - 20usize];
    ["Offset of field: b2CastOutput::hit"][::std::mem::offset_of!(b2CastOutput, hit) - 24usize];
};
#[doc = " This holds the mass data computed for a shape."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2MassData {
    #[doc = " The mass of the shape, usually in kilograms."]
    pub mass: f32,
    #[doc = " The position of the shape's centroid relative to the shape's origin."]
    pub center: b2Vec2,
    #[doc = " The rotational inertia of the shape about the shape center."]
    pub rotationalInertia: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2MassData"][::std::mem::size_of::<b2MassData>() - 16usize];
    ["Alignment of b2MassData"][::std::mem::align_of::<b2MassData>() - 4usize];
    ["Offset of field: b2MassData::mass"][::std::mem::offset_of!(b2MassData, mass) - 0usize];
    ["Offset of field: b2MassData::center"][::std::mem::offset_of!(b2MassData, center) - 4usize];
    ["Offset of field: b2MassData::rotationalInertia"][::std::mem::offset_of!(b2MassData, rotationalInertia) - 12usize];
};
#[doc = " A solid circle"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Circle {
    #[doc = " The local center"]
    pub center: b2Vec2,
    #[doc = " The radius"]
    pub radius: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Circle"][::std::mem::size_of::<b2Circle>() - 12usize];
    ["Alignment of b2Circle"][::std::mem::align_of::<b2Circle>() - 4usize];
    ["Offset of field: b2Circle::center"][::std::mem::offset_of!(b2Circle, center) - 0usize];
    ["Offset of field: b2Circle::radius"][::std::mem::offset_of!(b2Circle, radius) - 8usize];
};
#[doc = " A solid capsule can be viewed as two semicircles connected\n by a rectangle."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Capsule {
    #[doc = " Local center of the first semicircle"]
    pub center1: b2Vec2,
    #[doc = " Local center of the second semicircle"]
    pub center2: b2Vec2,
    #[doc = " The radius of the semicircles"]
    pub radius: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Capsule"][::std::mem::size_of::<b2Capsule>() - 20usize];
    ["Alignment of b2Capsule"][::std::mem::align_of::<b2Capsule>() - 4usize];
    ["Offset of field: b2Capsule::center1"][::std::mem::offset_of!(b2Capsule, center1) - 0usize];
    ["Offset of field: b2Capsule::center2"][::std::mem::offset_of!(b2Capsule, center2) - 8usize];
    ["Offset of field: b2Capsule::radius"][::std::mem::offset_of!(b2Capsule, radius) - 16usize];
};
#[doc = " A solid convex polygon. It is assumed that the interior of the polygon is to\n the left of each edge.\n Polygons have a maximum number of vertices equal to B2_MAX_POLYGON_VERTICES.\n In most cases you should not need many vertices for a convex polygon.\n @warning DO NOT fill this out manually, instead use a helper function like\n b2MakePolygon or b2MakeBox."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Polygon {
    #[doc = " The polygon vertices"]
    pub vertices: [b2Vec2; 8usize],
    #[doc = " The outward normal vectors of the polygon sides"]
    pub normals: [b2Vec2; 8usize],
    #[doc = " The centroid of the polygon"]
    pub centroid: b2Vec2,
    #[doc = " The external radius for rounded polygons"]
    pub radius: f32,
    #[doc = " The number of polygon vertices"]
    pub count: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Polygon"][::std::mem::size_of::<b2Polygon>() - 144usize];
    ["Alignment of b2Polygon"][::std::mem::align_of::<b2Polygon>() - 4usize];
    ["Offset of field: b2Polygon::vertices"][::std::mem::offset_of!(b2Polygon, vertices) - 0usize];
    ["Offset of field: b2Polygon::normals"][::std::mem::offset_of!(b2Polygon, normals) - 64usize];
    ["Offset of field: b2Polygon::centroid"][::std::mem::offset_of!(b2Polygon, centroid) - 128usize];
    ["Offset of field: b2Polygon::radius"][::std::mem::offset_of!(b2Polygon, radius) - 136usize];
    ["Offset of field: b2Polygon::count"][::std::mem::offset_of!(b2Polygon, count) - 140usize];
};
#[doc = " A line segment with two-sided collision."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Segment {
    #[doc = " The first point"]
    pub point1: b2Vec2,
    #[doc = " The second point"]
    pub point2: b2Vec2,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Segment"][::std::mem::size_of::<b2Segment>() - 16usize];
    ["Alignment of b2Segment"][::std::mem::align_of::<b2Segment>() - 4usize];
    ["Offset of field: b2Segment::point1"][::std::mem::offset_of!(b2Segment, point1) - 0usize];
    ["Offset of field: b2Segment::point2"][::std::mem::offset_of!(b2Segment, point2) - 8usize];
};
#[doc = " A line segment with one-sided collision. Only collides on the right side.\n Several of these are generated for a chain shape.\n ghost1 -> point1 -> point2 -> ghost2"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ChainSegment {
    #[doc = " The tail ghost vertex"]
    pub ghost1: b2Vec2,
    #[doc = " The line segment"]
    pub segment: b2Segment,
    #[doc = " The head ghost vertex"]
    pub ghost2: b2Vec2,
    #[doc = " The owning chain shape index (internal usage only)"]
    pub chainId: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ChainSegment"][::std::mem::size_of::<b2ChainSegment>() - 36usize];
    ["Alignment of b2ChainSegment"][::std::mem::align_of::<b2ChainSegment>() - 4usize];
    ["Offset of field: b2ChainSegment::ghost1"][::std::mem::offset_of!(b2ChainSegment, ghost1) - 0usize];
    ["Offset of field: b2ChainSegment::segment"][::std::mem::offset_of!(b2ChainSegment, segment) - 8usize];
    ["Offset of field: b2ChainSegment::ghost2"][::std::mem::offset_of!(b2ChainSegment, ghost2) - 24usize];
    ["Offset of field: b2ChainSegment::chainId"][::std::mem::offset_of!(b2ChainSegment, chainId) - 32usize];
};
#[doc = " A convex hull. Used to create convex polygons.\n @warning Do not modify these values directly, instead use b2ComputeHull()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Hull {
    #[doc = " The final points of the hull"]
    pub points: [b2Vec2; 8usize],
    #[doc = " The number of points"]
    pub count: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Hull"][::std::mem::size_of::<b2Hull>() - 68usize];
    ["Alignment of b2Hull"][::std::mem::align_of::<b2Hull>() - 4usize];
    ["Offset of field: b2Hull::points"][::std::mem::offset_of!(b2Hull, points) - 0usize];
    ["Offset of field: b2Hull::count"][::std::mem::offset_of!(b2Hull, count) - 64usize];
};
#[doc = " Result of computing the distance between two line segments"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2SegmentDistanceResult {
    #[doc = " The closest point on the first segment"]
    pub closest1: b2Vec2,
    #[doc = " The closest point on the second segment"]
    pub closest2: b2Vec2,
    #[doc = " The barycentric coordinate on the first segment"]
    pub fraction1: f32,
    #[doc = " The barycentric coordinate on the second segment"]
    pub fraction2: f32,
    #[doc = " The squared distance between the closest points"]
    pub distanceSquared: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2SegmentDistanceResult"][::std::mem::size_of::<b2SegmentDistanceResult>() - 28usize];
    ["Alignment of b2SegmentDistanceResult"][::std::mem::align_of::<b2SegmentDistanceResult>() - 4usize];
    ["Offset of field: b2SegmentDistanceResult::closest1"]
        [::std::mem::offset_of!(b2SegmentDistanceResult, closest1) - 0usize];
    ["Offset of field: b2SegmentDistanceResult::closest2"]
        [::std::mem::offset_of!(b2SegmentDistanceResult, closest2) - 8usize];
    ["Offset of field: b2SegmentDistanceResult::fraction1"]
        [::std::mem::offset_of!(b2SegmentDistanceResult, fraction1) - 16usize];
    ["Offset of field: b2SegmentDistanceResult::fraction2"]
        [::std::mem::offset_of!(b2SegmentDistanceResult, fraction2) - 20usize];
    ["Offset of field: b2SegmentDistanceResult::distanceSquared"]
        [::std::mem::offset_of!(b2SegmentDistanceResult, distanceSquared) - 24usize];
};
#[doc = " Used to warm start the GJK simplex. If you call this function multiple times with nearby\n transforms this might improve performance. Otherwise you can zero initialize this.\n The distance cache must be initialized to zero on the first call.\n Users should generally just zero initialize this structure for each call."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2SimplexCache {
    #[doc = " The number of stored simplex points"]
    pub count: u16,
    #[doc = " The cached simplex indices on shape A"]
    pub indexA: [u8; 3usize],
    #[doc = " The cached simplex indices on shape B"]
    pub indexB: [u8; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2SimplexCache"][::std::mem::size_of::<b2SimplexCache>() - 8usize];
    ["Alignment of b2SimplexCache"][::std::mem::align_of::<b2SimplexCache>() - 2usize];
    ["Offset of field: b2SimplexCache::count"][::std::mem::offset_of!(b2SimplexCache, count) - 0usize];
    ["Offset of field: b2SimplexCache::indexA"][::std::mem::offset_of!(b2SimplexCache, indexA) - 2usize];
    ["Offset of field: b2SimplexCache::indexB"][::std::mem::offset_of!(b2SimplexCache, indexB) - 5usize];
};
#[doc = " Input for b2ShapeDistance"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2DistanceInput {
    #[doc = " The proxy for shape A"]
    pub proxyA: b2ShapeProxy,
    #[doc = " The proxy for shape B"]
    pub proxyB: b2ShapeProxy,
    #[doc = " The world transform for shape A"]
    pub transformA: b2Transform,
    #[doc = " The world transform for shape B"]
    pub transformB: b2Transform,
    #[doc = " Should the proxy radius be considered?"]
    pub useRadii: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2DistanceInput"][::std::mem::size_of::<b2DistanceInput>() - 180usize];
    ["Alignment of b2DistanceInput"][::std::mem::align_of::<b2DistanceInput>() - 4usize];
    ["Offset of field: b2DistanceInput::proxyA"][::std::mem::offset_of!(b2DistanceInput, proxyA) - 0usize];
    ["Offset of field: b2DistanceInput::proxyB"][::std::mem::offset_of!(b2DistanceInput, proxyB) - 72usize];
    ["Offset of field: b2DistanceInput::transformA"][::std::mem::offset_of!(b2DistanceInput, transformA) - 144usize];
    ["Offset of field: b2DistanceInput::transformB"][::std::mem::offset_of!(b2DistanceInput, transformB) - 160usize];
    ["Offset of field: b2DistanceInput::useRadii"][::std::mem::offset_of!(b2DistanceInput, useRadii) - 176usize];
};
#[doc = " Output for b2ShapeDistance"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2DistanceOutput {
    #[doc = "< Closest point on shapeA"]
    pub pointA: b2Vec2,
    #[doc = "< Closest point on shapeB"]
    pub pointB: b2Vec2,
    #[doc = "< Normal vector that points from A to B. Invalid if distance is zero."]
    pub normal: b2Vec2,
    #[doc = "< The final distance, zero if overlapped"]
    pub distance: f32,
    #[doc = "< Number of GJK iterations used"]
    pub iterations: ::std::os::raw::c_int,
    #[doc = "< The number of simplexes stored in the simplex array"]
    pub simplexCount: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2DistanceOutput"][::std::mem::size_of::<b2DistanceOutput>() - 36usize];
    ["Alignment of b2DistanceOutput"][::std::mem::align_of::<b2DistanceOutput>() - 4usize];
    ["Offset of field: b2DistanceOutput::pointA"][::std::mem::offset_of!(b2DistanceOutput, pointA) - 0usize];
    ["Offset of field: b2DistanceOutput::pointB"][::std::mem::offset_of!(b2DistanceOutput, pointB) - 8usize];
    ["Offset of field: b2DistanceOutput::normal"][::std::mem::offset_of!(b2DistanceOutput, normal) - 16usize];
    ["Offset of field: b2DistanceOutput::distance"][::std::mem::offset_of!(b2DistanceOutput, distance) - 24usize];
    ["Offset of field: b2DistanceOutput::iterations"][::std::mem::offset_of!(b2DistanceOutput, iterations) - 28usize];
    ["Offset of field: b2DistanceOutput::simplexCount"]
        [::std::mem::offset_of!(b2DistanceOutput, simplexCount) - 32usize];
};
#[doc = " Simplex vertex for debugging the GJK algorithm"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2SimplexVertex {
    #[doc = "< support point in proxyA"]
    pub wA: b2Vec2,
    #[doc = "< support point in proxyB"]
    pub wB: b2Vec2,
    #[doc = "< wB - wA"]
    pub w: b2Vec2,
    #[doc = "< barycentric coordinate for closest point"]
    pub a: f32,
    #[doc = "< wA index"]
    pub indexA: ::std::os::raw::c_int,
    #[doc = "< wB index"]
    pub indexB: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2SimplexVertex"][::std::mem::size_of::<b2SimplexVertex>() - 36usize];
    ["Alignment of b2SimplexVertex"][::std::mem::align_of::<b2SimplexVertex>() - 4usize];
    ["Offset of field: b2SimplexVertex::wA"][::std::mem::offset_of!(b2SimplexVertex, wA) - 0usize];
    ["Offset of field: b2SimplexVertex::wB"][::std::mem::offset_of!(b2SimplexVertex, wB) - 8usize];
    ["Offset of field: b2SimplexVertex::w"][::std::mem::offset_of!(b2SimplexVertex, w) - 16usize];
    ["Offset of field: b2SimplexVertex::a"][::std::mem::offset_of!(b2SimplexVertex, a) - 24usize];
    ["Offset of field: b2SimplexVertex::indexA"][::std::mem::offset_of!(b2SimplexVertex, indexA) - 28usize];
    ["Offset of field: b2SimplexVertex::indexB"][::std::mem::offset_of!(b2SimplexVertex, indexB) - 32usize];
};
#[doc = " Simplex from the GJK algorithm"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Simplex {
    #[doc = "< vertices"]
    pub v1: b2SimplexVertex,
    #[doc = "< vertices"]
    pub v2: b2SimplexVertex,
    #[doc = "< vertices"]
    pub v3: b2SimplexVertex,
    #[doc = "< number of valid vertices"]
    pub count: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Simplex"][::std::mem::size_of::<b2Simplex>() - 112usize];
    ["Alignment of b2Simplex"][::std::mem::align_of::<b2Simplex>() - 4usize];
    ["Offset of field: b2Simplex::v1"][::std::mem::offset_of!(b2Simplex, v1) - 0usize];
    ["Offset of field: b2Simplex::v2"][::std::mem::offset_of!(b2Simplex, v2) - 36usize];
    ["Offset of field: b2Simplex::v3"][::std::mem::offset_of!(b2Simplex, v3) - 72usize];
    ["Offset of field: b2Simplex::count"][::std::mem::offset_of!(b2Simplex, count) - 108usize];
};
#[doc = " Input parameters for b2ShapeCast"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ShapeCastPairInput {
    #[doc = "< The proxy for shape A"]
    pub proxyA: b2ShapeProxy,
    #[doc = "< The proxy for shape B"]
    pub proxyB: b2ShapeProxy,
    #[doc = "< The world transform for shape A"]
    pub transformA: b2Transform,
    #[doc = "< The world transform for shape B"]
    pub transformB: b2Transform,
    #[doc = "< The translation of shape B"]
    pub translationB: b2Vec2,
    #[doc = "< The fraction of the translation to consider, typically 1"]
    pub maxFraction: f32,
    #[doc = "< Allows shapes with a radius to move slightly closer if already touching"]
    pub canEncroach: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ShapeCastPairInput"][::std::mem::size_of::<b2ShapeCastPairInput>() - 192usize];
    ["Alignment of b2ShapeCastPairInput"][::std::mem::align_of::<b2ShapeCastPairInput>() - 4usize];
    ["Offset of field: b2ShapeCastPairInput::proxyA"][::std::mem::offset_of!(b2ShapeCastPairInput, proxyA) - 0usize];
    ["Offset of field: b2ShapeCastPairInput::proxyB"][::std::mem::offset_of!(b2ShapeCastPairInput, proxyB) - 72usize];
    ["Offset of field: b2ShapeCastPairInput::transformA"]
        [::std::mem::offset_of!(b2ShapeCastPairInput, transformA) - 144usize];
    ["Offset of field: b2ShapeCastPairInput::transformB"]
        [::std::mem::offset_of!(b2ShapeCastPairInput, transformB) - 160usize];
    ["Offset of field: b2ShapeCastPairInput::translationB"]
        [::std::mem::offset_of!(b2ShapeCastPairInput, translationB) - 176usize];
    ["Offset of field: b2ShapeCastPairInput::maxFraction"]
        [::std::mem::offset_of!(b2ShapeCastPairInput, maxFraction) - 184usize];
    ["Offset of field: b2ShapeCastPairInput::canEncroach"]
        [::std::mem::offset_of!(b2ShapeCastPairInput, canEncroach) - 188usize];
};
#[doc = " This describes the motion of a body/shape for TOI computation. Shapes are defined with respect to the body origin,\n which may not coincide with the center of mass. However, to support dynamics we must interpolate the center of mass\n position."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Sweep {
    #[doc = "< Local center of mass position"]
    pub localCenter: b2Vec2,
    #[doc = "< Starting center of mass world position"]
    pub c1: b2Vec2,
    #[doc = "< Ending center of mass world position"]
    pub c2: b2Vec2,
    #[doc = "< Starting world rotation"]
    pub q1: b2Rot,
    #[doc = "< Ending world rotation"]
    pub q2: b2Rot,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Sweep"][::std::mem::size_of::<b2Sweep>() - 40usize];
    ["Alignment of b2Sweep"][::std::mem::align_of::<b2Sweep>() - 4usize];
    ["Offset of field: b2Sweep::localCenter"][::std::mem::offset_of!(b2Sweep, localCenter) - 0usize];
    ["Offset of field: b2Sweep::c1"][::std::mem::offset_of!(b2Sweep, c1) - 8usize];
    ["Offset of field: b2Sweep::c2"][::std::mem::offset_of!(b2Sweep, c2) - 16usize];
    ["Offset of field: b2Sweep::q1"][::std::mem::offset_of!(b2Sweep, q1) - 24usize];
    ["Offset of field: b2Sweep::q2"][::std::mem::offset_of!(b2Sweep, q2) - 32usize];
};
#[doc = " Time of impact input"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2TOIInput {
    #[doc = "< The proxy for shape A"]
    pub proxyA: b2ShapeProxy,
    #[doc = "< The proxy for shape B"]
    pub proxyB: b2ShapeProxy,
    #[doc = "< The movement of shape A"]
    pub sweepA: b2Sweep,
    #[doc = "< The movement of shape B"]
    pub sweepB: b2Sweep,
    #[doc = "< Defines the sweep interval [0, maxFraction]"]
    pub maxFraction: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2TOIInput"][::std::mem::size_of::<b2TOIInput>() - 228usize];
    ["Alignment of b2TOIInput"][::std::mem::align_of::<b2TOIInput>() - 4usize];
    ["Offset of field: b2TOIInput::proxyA"][::std::mem::offset_of!(b2TOIInput, proxyA) - 0usize];
    ["Offset of field: b2TOIInput::proxyB"][::std::mem::offset_of!(b2TOIInput, proxyB) - 72usize];
    ["Offset of field: b2TOIInput::sweepA"][::std::mem::offset_of!(b2TOIInput, sweepA) - 144usize];
    ["Offset of field: b2TOIInput::sweepB"][::std::mem::offset_of!(b2TOIInput, sweepB) - 184usize];
    ["Offset of field: b2TOIInput::maxFraction"][::std::mem::offset_of!(b2TOIInput, maxFraction) - 224usize];
};
pub const b2TOIState_b2_toiStateUnknown: b2TOIState = 0;
pub const b2TOIState_b2_toiStateFailed: b2TOIState = 1;
pub const b2TOIState_b2_toiStateOverlapped: b2TOIState = 2;
pub const b2TOIState_b2_toiStateHit: b2TOIState = 3;
pub const b2TOIState_b2_toiStateSeparated: b2TOIState = 4;
#[doc = " Describes the TOI output"]
pub type b2TOIState = ::std::os::raw::c_uint;
#[doc = " Time of impact output"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2TOIOutput {
    #[doc = " The type of result"]
    pub state: b2TOIState,
    #[doc = " The hit point"]
    pub point: b2Vec2,
    #[doc = " The hit normal"]
    pub normal: b2Vec2,
    #[doc = " The sweep time of the collision"]
    pub fraction: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2TOIOutput"][::std::mem::size_of::<b2TOIOutput>() - 24usize];
    ["Alignment of b2TOIOutput"][::std::mem::align_of::<b2TOIOutput>() - 4usize];
    ["Offset of field: b2TOIOutput::state"][::std::mem::offset_of!(b2TOIOutput, state) - 0usize];
    ["Offset of field: b2TOIOutput::point"][::std::mem::offset_of!(b2TOIOutput, point) - 4usize];
    ["Offset of field: b2TOIOutput::normal"][::std::mem::offset_of!(b2TOIOutput, normal) - 12usize];
    ["Offset of field: b2TOIOutput::fraction"][::std::mem::offset_of!(b2TOIOutput, fraction) - 20usize];
};
#[doc = " A manifold point is a contact point belonging to a contact manifold.\n It holds details related to the geometry and dynamics of the contact points.\n Box2D uses speculative collision so some contact points may be separated.\n You may use the totalNormalImpulse to determine if there was an interaction during\n the time step."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ManifoldPoint {
    #[doc = " Location of the contact point in world space. Subject to precision loss at large coordinates.\n @note Should only be used for debugging."]
    pub point: b2Vec2,
    #[doc = " Location of the contact point relative to shapeA's origin in world space\n @note When used internally to the Box2D solver, this is relative to the body center of mass."]
    pub anchorA: b2Vec2,
    #[doc = " Location of the contact point relative to shapeB's origin in world space\n @note When used internally to the Box2D solver, this is relative to the body center of mass."]
    pub anchorB: b2Vec2,
    #[doc = " The separation of the contact point, negative if penetrating"]
    pub separation: f32,
    #[doc = " The impulse along the manifold normal vector."]
    pub normalImpulse: f32,
    #[doc = " The friction impulse"]
    pub tangentImpulse: f32,
    #[doc = " The total normal impulse applied across sub-stepping and restitution. This is important\n to identify speculative contact points that had an interaction in the time step."]
    pub totalNormalImpulse: f32,
    #[doc = " Relative normal velocity pre-solve. Used for hit events. If the normal impulse is\n zero then there was no hit. Negative means shapes are approaching."]
    pub normalVelocity: f32,
    #[doc = " Uniquely identifies a contact point between two shapes"]
    pub id: u16,
    #[doc = " Did this contact point exist the previous step?"]
    pub persisted: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ManifoldPoint"][::std::mem::size_of::<b2ManifoldPoint>() - 48usize];
    ["Alignment of b2ManifoldPoint"][::std::mem::align_of::<b2ManifoldPoint>() - 4usize];
    ["Offset of field: b2ManifoldPoint::point"][::std::mem::offset_of!(b2ManifoldPoint, point) - 0usize];
    ["Offset of field: b2ManifoldPoint::anchorA"][::std::mem::offset_of!(b2ManifoldPoint, anchorA) - 8usize];
    ["Offset of field: b2ManifoldPoint::anchorB"][::std::mem::offset_of!(b2ManifoldPoint, anchorB) - 16usize];
    ["Offset of field: b2ManifoldPoint::separation"][::std::mem::offset_of!(b2ManifoldPoint, separation) - 24usize];
    ["Offset of field: b2ManifoldPoint::normalImpulse"]
        [::std::mem::offset_of!(b2ManifoldPoint, normalImpulse) - 28usize];
    ["Offset of field: b2ManifoldPoint::tangentImpulse"]
        [::std::mem::offset_of!(b2ManifoldPoint, tangentImpulse) - 32usize];
    ["Offset of field: b2ManifoldPoint::totalNormalImpulse"]
        [::std::mem::offset_of!(b2ManifoldPoint, totalNormalImpulse) - 36usize];
    ["Offset of field: b2ManifoldPoint::normalVelocity"]
        [::std::mem::offset_of!(b2ManifoldPoint, normalVelocity) - 40usize];
    ["Offset of field: b2ManifoldPoint::id"][::std::mem::offset_of!(b2ManifoldPoint, id) - 44usize];
    ["Offset of field: b2ManifoldPoint::persisted"][::std::mem::offset_of!(b2ManifoldPoint, persisted) - 46usize];
};
#[doc = " A contact manifold describes the contact points between colliding shapes.\n @note Box2D uses speculative collision so some contact points may be separated."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Manifold {
    #[doc = " The unit normal vector in world space, points from shape A to bodyB"]
    pub normal: b2Vec2,
    #[doc = " Angular impulse applied for rolling resistance. N * m * s = kg * m^2 / s"]
    pub rollingImpulse: f32,
    #[doc = " The manifold points, up to two are possible in 2D"]
    pub points: [b2ManifoldPoint; 2usize],
    #[doc = " The number of contacts points, will be 0, 1, or 2"]
    pub pointCount: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Manifold"][::std::mem::size_of::<b2Manifold>() - 112usize];
    ["Alignment of b2Manifold"][::std::mem::align_of::<b2Manifold>() - 4usize];
    ["Offset of field: b2Manifold::normal"][::std::mem::offset_of!(b2Manifold, normal) - 0usize];
    ["Offset of field: b2Manifold::rollingImpulse"][::std::mem::offset_of!(b2Manifold, rollingImpulse) - 8usize];
    ["Offset of field: b2Manifold::points"][::std::mem::offset_of!(b2Manifold, points) - 12usize];
    ["Offset of field: b2Manifold::pointCount"][::std::mem::offset_of!(b2Manifold, pointCount) - 108usize];
};
#[doc = " The dynamic tree structure. This should be considered private data.\n It is placed here for performance reasons."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2DynamicTree {
    #[doc = " The tree nodes"]
    pub nodes: *mut b2TreeNode,
    #[doc = " The root index"]
    pub root: ::std::os::raw::c_int,
    #[doc = " The number of nodes"]
    pub nodeCount: ::std::os::raw::c_int,
    #[doc = " The allocated node space"]
    pub nodeCapacity: ::std::os::raw::c_int,
    #[doc = " Node free list"]
    pub freeList: ::std::os::raw::c_int,
    #[doc = " Number of proxies created"]
    pub proxyCount: ::std::os::raw::c_int,
    #[doc = " Leaf indices for rebuild"]
    pub leafIndices: *mut ::std::os::raw::c_int,
    #[doc = " Leaf bounding boxes for rebuild"]
    pub leafBoxes: *mut b2AABB,
    #[doc = " Leaf bounding box centers for rebuild"]
    pub leafCenters: *mut b2Vec2,
    #[doc = " Bins for sorting during rebuild"]
    pub binIndices: *mut ::std::os::raw::c_int,
    #[doc = " Allocated space for rebuilding"]
    pub rebuildCapacity: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2DynamicTree"][::std::mem::size_of::<b2DynamicTree>() - 72usize];
    ["Alignment of b2DynamicTree"][::std::mem::align_of::<b2DynamicTree>() - 8usize];
    ["Offset of field: b2DynamicTree::nodes"][::std::mem::offset_of!(b2DynamicTree, nodes) - 0usize];
    ["Offset of field: b2DynamicTree::root"][::std::mem::offset_of!(b2DynamicTree, root) - 8usize];
    ["Offset of field: b2DynamicTree::nodeCount"][::std::mem::offset_of!(b2DynamicTree, nodeCount) - 12usize];
    ["Offset of field: b2DynamicTree::nodeCapacity"][::std::mem::offset_of!(b2DynamicTree, nodeCapacity) - 16usize];
    ["Offset of field: b2DynamicTree::freeList"][::std::mem::offset_of!(b2DynamicTree, freeList) - 20usize];
    ["Offset of field: b2DynamicTree::proxyCount"][::std::mem::offset_of!(b2DynamicTree, proxyCount) - 24usize];
    ["Offset of field: b2DynamicTree::leafIndices"][::std::mem::offset_of!(b2DynamicTree, leafIndices) - 32usize];
    ["Offset of field: b2DynamicTree::leafBoxes"][::std::mem::offset_of!(b2DynamicTree, leafBoxes) - 40usize];
    ["Offset of field: b2DynamicTree::leafCenters"][::std::mem::offset_of!(b2DynamicTree, leafCenters) - 48usize];
    ["Offset of field: b2DynamicTree::binIndices"][::std::mem::offset_of!(b2DynamicTree, binIndices) - 56usize];
    ["Offset of field: b2DynamicTree::rebuildCapacity"]
        [::std::mem::offset_of!(b2DynamicTree, rebuildCapacity) - 64usize];
};
#[doc = " These are performance results returned by dynamic tree queries."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2TreeStats {
    #[doc = " Number of internal nodes visited during the query"]
    pub nodeVisits: ::std::os::raw::c_int,
    #[doc = " Number of leaf nodes visited during the query"]
    pub leafVisits: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2TreeStats"][::std::mem::size_of::<b2TreeStats>() - 8usize];
    ["Alignment of b2TreeStats"][::std::mem::align_of::<b2TreeStats>() - 4usize];
    ["Offset of field: b2TreeStats::nodeVisits"][::std::mem::offset_of!(b2TreeStats, nodeVisits) - 0usize];
    ["Offset of field: b2TreeStats::leafVisits"][::std::mem::offset_of!(b2TreeStats, leafVisits) - 4usize];
};
#[doc = " This function receives proxies found in the AABB query.\n @return true if the query should continue"]
pub type b2TreeQueryCallbackFcn = ::std::option::Option<
    unsafe extern "C" fn(proxyId: ::std::os::raw::c_int, userData: u64, context: *mut ::std::os::raw::c_void) -> bool,
>;
#[doc = " This function receives clipped ray cast input for a proxy. The function\n returns the new ray fraction.\n - return a value of 0 to terminate the ray cast\n - return a value less than input->maxFraction to clip the ray\n - return a value of input->maxFraction to continue the ray cast without clipping"]
pub type b2TreeRayCastCallbackFcn = ::std::option::Option<
    unsafe extern "C" fn(
        input: *const b2RayCastInput,
        proxyId: ::std::os::raw::c_int,
        userData: u64,
        context: *mut ::std::os::raw::c_void,
    ) -> f32,
>;
#[doc = " This function receives clipped ray cast input for a proxy. The function\n returns the new ray fraction.\n - return a value of 0 to terminate the ray cast\n - return a value less than input->maxFraction to clip the ray\n - return a value of input->maxFraction to continue the ray cast without clipping"]
pub type b2TreeShapeCastCallbackFcn = ::std::option::Option<
    unsafe extern "C" fn(
        input: *const b2ShapeCastInput,
        proxyId: ::std::os::raw::c_int,
        userData: u64,
        context: *mut ::std::os::raw::c_void,
    ) -> f32,
>;
#[doc = " These are the collision planes returned from b2World_CollideMover"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2PlaneResult {
    #[doc = " The collision plane between the mover and a convex shape"]
    pub plane: b2Plane,
    pub point: b2Vec2,
    #[doc = " Did the collision register a hit? If not this plane should be ignored."]
    pub hit: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2PlaneResult"][::std::mem::size_of::<b2PlaneResult>() - 24usize];
    ["Alignment of b2PlaneResult"][::std::mem::align_of::<b2PlaneResult>() - 4usize];
    ["Offset of field: b2PlaneResult::plane"][::std::mem::offset_of!(b2PlaneResult, plane) - 0usize];
    ["Offset of field: b2PlaneResult::point"][::std::mem::offset_of!(b2PlaneResult, point) - 12usize];
    ["Offset of field: b2PlaneResult::hit"][::std::mem::offset_of!(b2PlaneResult, hit) - 20usize];
};
#[doc = " These are collision planes that can be fed to b2SolvePlanes. Normally\n this is assembled by the user from plane results in b2PlaneResult"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2CollisionPlane {
    #[doc = " The collision plane between the mover and some shape"]
    pub plane: b2Plane,
    #[doc = " Setting this to FLT_MAX makes the plane as rigid as possible. Lower values can\n make the plane collision soft. Usually in meters."]
    pub pushLimit: f32,
    #[doc = " The push on the mover determined by b2SolvePlanes. Usually in meters."]
    pub push: f32,
    #[doc = " Indicates if b2ClipVector should clip against this plane. Should be false for soft collision."]
    pub clipVelocity: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2CollisionPlane"][::std::mem::size_of::<b2CollisionPlane>() - 24usize];
    ["Alignment of b2CollisionPlane"][::std::mem::align_of::<b2CollisionPlane>() - 4usize];
    ["Offset of field: b2CollisionPlane::plane"][::std::mem::offset_of!(b2CollisionPlane, plane) - 0usize];
    ["Offset of field: b2CollisionPlane::pushLimit"][::std::mem::offset_of!(b2CollisionPlane, pushLimit) - 12usize];
    ["Offset of field: b2CollisionPlane::push"][::std::mem::offset_of!(b2CollisionPlane, push) - 16usize];
    ["Offset of field: b2CollisionPlane::clipVelocity"]
        [::std::mem::offset_of!(b2CollisionPlane, clipVelocity) - 20usize];
};
#[doc = " Result returned by b2SolvePlanes"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2PlaneSolverResult {
    #[doc = " The translation of the mover"]
    pub translation: b2Vec2,
    #[doc = " The number of iterations used by the plane solver. For diagnostics."]
    pub iterationCount: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2PlaneSolverResult"][::std::mem::size_of::<b2PlaneSolverResult>() - 12usize];
    ["Alignment of b2PlaneSolverResult"][::std::mem::align_of::<b2PlaneSolverResult>() - 4usize];
    ["Offset of field: b2PlaneSolverResult::translation"]
        [::std::mem::offset_of!(b2PlaneSolverResult, translation) - 0usize];
    ["Offset of field: b2PlaneSolverResult::iterationCount"]
        [::std::mem::offset_of!(b2PlaneSolverResult, iterationCount) - 8usize];
};
#[doc = " World id references a world instance. This should be treated as an opaque handle."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2WorldId {
    pub index1: u16,
    pub generation: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2WorldId"][::std::mem::size_of::<b2WorldId>() - 4usize];
    ["Alignment of b2WorldId"][::std::mem::align_of::<b2WorldId>() - 2usize];
    ["Offset of field: b2WorldId::index1"][::std::mem::offset_of!(b2WorldId, index1) - 0usize];
    ["Offset of field: b2WorldId::generation"][::std::mem::offset_of!(b2WorldId, generation) - 2usize];
};
#[doc = " Body id references a body instance. This should be treated as an opaque handle."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2BodyId {
    pub index1: i32,
    pub world0: u16,
    pub generation: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2BodyId"][::std::mem::size_of::<b2BodyId>() - 8usize];
    ["Alignment of b2BodyId"][::std::mem::align_of::<b2BodyId>() - 4usize];
    ["Offset of field: b2BodyId::index1"][::std::mem::offset_of!(b2BodyId, index1) - 0usize];
    ["Offset of field: b2BodyId::world0"][::std::mem::offset_of!(b2BodyId, world0) - 4usize];
    ["Offset of field: b2BodyId::generation"][::std::mem::offset_of!(b2BodyId, generation) - 6usize];
};
#[doc = " Shape id references a shape instance. This should be treated as an opaque handle."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ShapeId {
    pub index1: i32,
    pub world0: u16,
    pub generation: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ShapeId"][::std::mem::size_of::<b2ShapeId>() - 8usize];
    ["Alignment of b2ShapeId"][::std::mem::align_of::<b2ShapeId>() - 4usize];
    ["Offset of field: b2ShapeId::index1"][::std::mem::offset_of!(b2ShapeId, index1) - 0usize];
    ["Offset of field: b2ShapeId::world0"][::std::mem::offset_of!(b2ShapeId, world0) - 4usize];
    ["Offset of field: b2ShapeId::generation"][::std::mem::offset_of!(b2ShapeId, generation) - 6usize];
};
#[doc = " Chain id references a chain instances. This should be treated as an opaque handle."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ChainId {
    pub index1: i32,
    pub world0: u16,
    pub generation: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ChainId"][::std::mem::size_of::<b2ChainId>() - 8usize];
    ["Alignment of b2ChainId"][::std::mem::align_of::<b2ChainId>() - 4usize];
    ["Offset of field: b2ChainId::index1"][::std::mem::offset_of!(b2ChainId, index1) - 0usize];
    ["Offset of field: b2ChainId::world0"][::std::mem::offset_of!(b2ChainId, world0) - 4usize];
    ["Offset of field: b2ChainId::generation"][::std::mem::offset_of!(b2ChainId, generation) - 6usize];
};
#[doc = " Joint id references a joint instance. This should be treated as an opaque handle."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2JointId {
    pub index1: i32,
    pub world0: u16,
    pub generation: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2JointId"][::std::mem::size_of::<b2JointId>() - 8usize];
    ["Alignment of b2JointId"][::std::mem::align_of::<b2JointId>() - 4usize];
    ["Offset of field: b2JointId::index1"][::std::mem::offset_of!(b2JointId, index1) - 0usize];
    ["Offset of field: b2JointId::world0"][::std::mem::offset_of!(b2JointId, world0) - 4usize];
    ["Offset of field: b2JointId::generation"][::std::mem::offset_of!(b2JointId, generation) - 6usize];
};
#[doc = " Contact id references a contact instance. This should be treated as an opaque handled."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ContactId {
    pub index1: i32,
    pub world0: u16,
    pub padding: i16,
    pub generation: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ContactId"][::std::mem::size_of::<b2ContactId>() - 12usize];
    ["Alignment of b2ContactId"][::std::mem::align_of::<b2ContactId>() - 4usize];
    ["Offset of field: b2ContactId::index1"][::std::mem::offset_of!(b2ContactId, index1) - 0usize];
    ["Offset of field: b2ContactId::world0"][::std::mem::offset_of!(b2ContactId, world0) - 4usize];
    ["Offset of field: b2ContactId::padding"][::std::mem::offset_of!(b2ContactId, padding) - 6usize];
    ["Offset of field: b2ContactId::generation"][::std::mem::offset_of!(b2ContactId, generation) - 8usize];
};
#[doc = " Task interface\n This is prototype for a Box2D task. Your task system is expected to invoke the Box2D task with these arguments.\n The task spans a range of the parallel-for: [startIndex, endIndex)\n The worker index must correctly identify each worker in the user thread pool, expected in [0, workerCount).\n A worker must only exist on only one thread at a time and is analogous to the thread index.\n The task context is the context pointer sent from Box2D when it is enqueued.\n The startIndex and endIndex are expected in the range [0, itemCount) where itemCount is the argument to b2EnqueueTaskCallback\n below. Box2D expects startIndex < endIndex and will execute a loop like this:\n\n @code{.c}\n for (int i = startIndex; i < endIndex; ++i)\n {\n \tDoWork();\n }\n @endcode\n @ingroup world"]
pub type b2TaskCallback = ::std::option::Option<
    unsafe extern "C" fn(
        startIndex: ::std::os::raw::c_int,
        endIndex: ::std::os::raw::c_int,
        workerIndex: u32,
        taskContext: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " These functions can be provided to Box2D to invoke a task system. These are designed to work well with enkiTS.\n Returns a pointer to the user's task object. May be nullptr. A nullptr indicates to Box2D that the work was executed\n serially within the callback and there is no need to call b2FinishTaskCallback.\n The itemCount is the number of Box2D work items that are to be partitioned among workers by the user's task system.\n This is essentially a parallel-for. The minRange parameter is a suggestion of the minimum number of items to assign\n per worker to reduce overhead. For example, suppose the task is small and that itemCount is 16. A minRange of 8 suggests\n that your task system should split the work items among just two workers, even if you have more available.\n In general the range [startIndex, endIndex) send to b2TaskCallback should obey:\n endIndex - startIndex >= minRange\n The exception of course is when itemCount < minRange.\n @ingroup world"]
pub type b2EnqueueTaskCallback = ::std::option::Option<
    unsafe extern "C" fn(
        task: b2TaskCallback,
        itemCount: ::std::os::raw::c_int,
        minRange: ::std::os::raw::c_int,
        taskContext: *mut ::std::os::raw::c_void,
        userContext: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
#[doc = " Finishes a user task object that wraps a Box2D task.\n @ingroup world"]
pub type b2FinishTaskCallback = ::std::option::Option<
    unsafe extern "C" fn(userTask: *mut ::std::os::raw::c_void, userContext: *mut ::std::os::raw::c_void),
>;
#[doc = " Optional friction mixing callback. This intentionally provides no context objects because this is called\n from a worker thread.\n @warning This function should not attempt to modify Box2D state or user application state.\n @ingroup world"]
pub type b2FrictionCallback = ::std::option::Option<
    unsafe extern "C" fn(frictionA: f32, userMaterialIdA: u64, frictionB: f32, userMaterialIdB: u64) -> f32,
>;
#[doc = " Optional restitution mixing callback. This intentionally provides no context objects because this is called\n from a worker thread.\n @warning This function should not attempt to modify Box2D state or user application state.\n @ingroup world"]
pub type b2RestitutionCallback = ::std::option::Option<
    unsafe extern "C" fn(restitutionA: f32, userMaterialIdA: u64, restitutionB: f32, userMaterialIdB: u64) -> f32,
>;
#[doc = " Result from b2World_RayCastClosest\n If there is initial overlap the fraction and normal will be zero while the point is an arbitrary point in the overlap region.\n @ingroup world"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2RayResult {
    pub shapeId: b2ShapeId,
    pub point: b2Vec2,
    pub normal: b2Vec2,
    pub fraction: f32,
    pub nodeVisits: ::std::os::raw::c_int,
    pub leafVisits: ::std::os::raw::c_int,
    pub hit: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2RayResult"][::std::mem::size_of::<b2RayResult>() - 40usize];
    ["Alignment of b2RayResult"][::std::mem::align_of::<b2RayResult>() - 4usize];
    ["Offset of field: b2RayResult::shapeId"][::std::mem::offset_of!(b2RayResult, shapeId) - 0usize];
    ["Offset of field: b2RayResult::point"][::std::mem::offset_of!(b2RayResult, point) - 8usize];
    ["Offset of field: b2RayResult::normal"][::std::mem::offset_of!(b2RayResult, normal) - 16usize];
    ["Offset of field: b2RayResult::fraction"][::std::mem::offset_of!(b2RayResult, fraction) - 24usize];
    ["Offset of field: b2RayResult::nodeVisits"][::std::mem::offset_of!(b2RayResult, nodeVisits) - 28usize];
    ["Offset of field: b2RayResult::leafVisits"][::std::mem::offset_of!(b2RayResult, leafVisits) - 32usize];
    ["Offset of field: b2RayResult::hit"][::std::mem::offset_of!(b2RayResult, hit) - 36usize];
};
#[doc = " World definition used to create a simulation world.\n Must be initialized using b2DefaultWorldDef().\n @ingroup world"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2WorldDef {
    #[doc = " Gravity vector. Box2D has no up-vector defined."]
    pub gravity: b2Vec2,
    #[doc = " Restitution speed threshold, usually in m/s. Collisions above this\n speed have restitution applied (will bounce)."]
    pub restitutionThreshold: f32,
    #[doc = " Threshold speed for hit events. Usually meters per second."]
    pub hitEventThreshold: f32,
    #[doc = " Contact stiffness. Cycles per second. Increasing this increases the speed of overlap recovery, but can introduce jitter."]
    pub contactHertz: f32,
    #[doc = " Contact bounciness. Non-dimensional. You can speed up overlap recovery by decreasing this with\n the trade-off that overlap resolution becomes more energetic."]
    pub contactDampingRatio: f32,
    #[doc = " This parameter controls how fast overlap is resolved and usually has units of meters per second. This only\n puts a cap on the resolution speed. The resolution speed is increased by increasing the hertz and/or\n decreasing the damping ratio."]
    pub contactSpeed: f32,
    #[doc = " Maximum linear speed. Usually meters per second."]
    pub maximumLinearSpeed: f32,
    #[doc = " Optional mixing callback for friction. The default uses sqrt(frictionA * frictionB)."]
    pub frictionCallback: b2FrictionCallback,
    #[doc = " Optional mixing callback for restitution. The default uses max(restitutionA, restitutionB)."]
    pub restitutionCallback: b2RestitutionCallback,
    #[doc = " Can bodies go to sleep to improve performance"]
    pub enableSleep: bool,
    #[doc = " Enable continuous collision"]
    pub enableContinuous: bool,
    #[doc = " Number of workers to use with the provided task system. Box2D performs best when using only\n performance cores and accessing a single L2 cache. Efficiency cores and hyper-threading provide\n little benefit and may even harm performance.\n @note Box2D does not create threads. This is the number of threads your applications has created\n that you are allocating to b2World_Step.\n @warning Do not modify the default value unless you are also providing a task system and providing\n task callbacks (enqueueTask and finishTask)."]
    pub workerCount: ::std::os::raw::c_int,
    #[doc = " Function to spawn tasks"]
    pub enqueueTask: b2EnqueueTaskCallback,
    #[doc = " Function to finish a task"]
    pub finishTask: b2FinishTaskCallback,
    #[doc = " User context that is provided to enqueueTask and finishTask"]
    pub userTaskContext: *mut ::std::os::raw::c_void,
    #[doc = " User data"]
    pub userData: *mut ::std::os::raw::c_void,
    #[doc = " Used internally to detect a valid definition. DO NOT SET."]
    pub internalValue: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2WorldDef"][::std::mem::size_of::<b2WorldDef>() - 96usize];
    ["Alignment of b2WorldDef"][::std::mem::align_of::<b2WorldDef>() - 8usize];
    ["Offset of field: b2WorldDef::gravity"][::std::mem::offset_of!(b2WorldDef, gravity) - 0usize];
    ["Offset of field: b2WorldDef::restitutionThreshold"]
        [::std::mem::offset_of!(b2WorldDef, restitutionThreshold) - 8usize];
    ["Offset of field: b2WorldDef::hitEventThreshold"][::std::mem::offset_of!(b2WorldDef, hitEventThreshold) - 12usize];
    ["Offset of field: b2WorldDef::contactHertz"][::std::mem::offset_of!(b2WorldDef, contactHertz) - 16usize];
    ["Offset of field: b2WorldDef::contactDampingRatio"]
        [::std::mem::offset_of!(b2WorldDef, contactDampingRatio) - 20usize];
    ["Offset of field: b2WorldDef::contactSpeed"][::std::mem::offset_of!(b2WorldDef, contactSpeed) - 24usize];
    ["Offset of field: b2WorldDef::maximumLinearSpeed"]
        [::std::mem::offset_of!(b2WorldDef, maximumLinearSpeed) - 28usize];
    ["Offset of field: b2WorldDef::frictionCallback"][::std::mem::offset_of!(b2WorldDef, frictionCallback) - 32usize];
    ["Offset of field: b2WorldDef::restitutionCallback"]
        [::std::mem::offset_of!(b2WorldDef, restitutionCallback) - 40usize];
    ["Offset of field: b2WorldDef::enableSleep"][::std::mem::offset_of!(b2WorldDef, enableSleep) - 48usize];
    ["Offset of field: b2WorldDef::enableContinuous"][::std::mem::offset_of!(b2WorldDef, enableContinuous) - 49usize];
    ["Offset of field: b2WorldDef::workerCount"][::std::mem::offset_of!(b2WorldDef, workerCount) - 52usize];
    ["Offset of field: b2WorldDef::enqueueTask"][::std::mem::offset_of!(b2WorldDef, enqueueTask) - 56usize];
    ["Offset of field: b2WorldDef::finishTask"][::std::mem::offset_of!(b2WorldDef, finishTask) - 64usize];
    ["Offset of field: b2WorldDef::userTaskContext"][::std::mem::offset_of!(b2WorldDef, userTaskContext) - 72usize];
    ["Offset of field: b2WorldDef::userData"][::std::mem::offset_of!(b2WorldDef, userData) - 80usize];
    ["Offset of field: b2WorldDef::internalValue"][::std::mem::offset_of!(b2WorldDef, internalValue) - 88usize];
};
#[doc = " zero mass, zero velocity, may be manually moved"]
pub const b2BodyType_b2_staticBody: b2BodyType = 0;
#[doc = " zero mass, velocity set by user, moved by solver"]
pub const b2BodyType_b2_kinematicBody: b2BodyType = 1;
#[doc = " positive mass, velocity determined by forces, moved by solver"]
pub const b2BodyType_b2_dynamicBody: b2BodyType = 2;
#[doc = " number of body types"]
pub const b2BodyType_b2_bodyTypeCount: b2BodyType = 3;
#[doc = " The body simulation type.\n Each body is one of these three types. The type determines how the body behaves in the simulation.\n @ingroup body"]
pub type b2BodyType = ::std::os::raw::c_uint;
#[doc = " Motion locks to restrict the body movement"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2MotionLocks {
    #[doc = " Prevent translation along the x-axis"]
    pub linearX: bool,
    #[doc = " Prevent translation along the y-axis"]
    pub linearY: bool,
    #[doc = " Prevent rotation around the z-axis"]
    pub angularZ: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2MotionLocks"][::std::mem::size_of::<b2MotionLocks>() - 3usize];
    ["Alignment of b2MotionLocks"][::std::mem::align_of::<b2MotionLocks>() - 1usize];
    ["Offset of field: b2MotionLocks::linearX"][::std::mem::offset_of!(b2MotionLocks, linearX) - 0usize];
    ["Offset of field: b2MotionLocks::linearY"][::std::mem::offset_of!(b2MotionLocks, linearY) - 1usize];
    ["Offset of field: b2MotionLocks::angularZ"][::std::mem::offset_of!(b2MotionLocks, angularZ) - 2usize];
};
#[doc = " A body definition holds all the data needed to construct a rigid body.\n You can safely re-use body definitions. Shapes are added to a body after construction.\n Body definitions are temporary objects used to bundle creation parameters.\n Must be initialized using b2DefaultBodyDef().\n @ingroup body"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2BodyDef {
    #[doc = " The body type: static, kinematic, or dynamic."]
    pub type_: b2BodyType,
    #[doc = " The initial world position of the body. Bodies should be created with the desired position.\n @note Creating bodies at the origin and then moving them nearly doubles the cost of body creation, especially\n if the body is moved after shapes have been added."]
    pub position: b2Vec2,
    #[doc = " The initial world rotation of the body. Use b2MakeRot() if you have an angle."]
    pub rotation: b2Rot,
    #[doc = " The initial linear velocity of the body's origin. Usually in meters per second."]
    pub linearVelocity: b2Vec2,
    #[doc = " The initial angular velocity of the body. Radians per second."]
    pub angularVelocity: f32,
    #[doc = " Linear damping is used to reduce the linear velocity. The damping parameter\n can be larger than 1 but the damping effect becomes sensitive to the\n time step when the damping parameter is large.\n Generally linear damping is undesirable because it makes objects move slowly\n as if they are floating."]
    pub linearDamping: f32,
    #[doc = " Angular damping is used to reduce the angular velocity. The damping parameter\n can be larger than 1.0f but the damping effect becomes sensitive to the\n time step when the damping parameter is large.\n Angular damping can be use slow down rotating bodies."]
    pub angularDamping: f32,
    #[doc = " Scale the gravity applied to this body. Non-dimensional."]
    pub gravityScale: f32,
    #[doc = " Sleep speed threshold, default is 0.05 meters per second"]
    pub sleepThreshold: f32,
    #[doc = " Optional body name for debugging. Up to 31 characters (excluding null termination)"]
    pub name: *const ::std::os::raw::c_char,
    #[doc = " Use this to store application specific body data."]
    pub userData: *mut ::std::os::raw::c_void,
    #[doc = " Motions locks to restrict linear and angular movement.\n Caution: may lead to softer constraints along the locked direction"]
    pub motionLocks: b2MotionLocks,
    #[doc = " Set this flag to false if this body should never fall asleep."]
    pub enableSleep: bool,
    #[doc = " Is this body initially awake or sleeping?"]
    pub isAwake: bool,
    #[doc = " Treat this body as high speed object that performs continuous collision detection\n against dynamic and kinematic bodies, but not other bullet bodies.\n @warning Bullets should be used sparingly. They are not a solution for general dynamic-versus-dynamic\n continuous collision."]
    pub isBullet: bool,
    #[doc = " Used to disable a body. A disabled body does not move or collide."]
    pub isEnabled: bool,
    #[doc = " This allows this body to bypass rotational speed limits. Should only be used\n for circular objects, like wheels."]
    pub allowFastRotation: bool,
    #[doc = " Used internally to detect a valid definition. DO NOT SET."]
    pub internalValue: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2BodyDef"][::std::mem::size_of::<b2BodyDef>() - 80usize];
    ["Alignment of b2BodyDef"][::std::mem::align_of::<b2BodyDef>() - 8usize];
    ["Offset of field: b2BodyDef::type_"][::std::mem::offset_of!(b2BodyDef, type_) - 0usize];
    ["Offset of field: b2BodyDef::position"][::std::mem::offset_of!(b2BodyDef, position) - 4usize];
    ["Offset of field: b2BodyDef::rotation"][::std::mem::offset_of!(b2BodyDef, rotation) - 12usize];
    ["Offset of field: b2BodyDef::linearVelocity"][::std::mem::offset_of!(b2BodyDef, linearVelocity) - 20usize];
    ["Offset of field: b2BodyDef::angularVelocity"][::std::mem::offset_of!(b2BodyDef, angularVelocity) - 28usize];
    ["Offset of field: b2BodyDef::linearDamping"][::std::mem::offset_of!(b2BodyDef, linearDamping) - 32usize];
    ["Offset of field: b2BodyDef::angularDamping"][::std::mem::offset_of!(b2BodyDef, angularDamping) - 36usize];
    ["Offset of field: b2BodyDef::gravityScale"][::std::mem::offset_of!(b2BodyDef, gravityScale) - 40usize];
    ["Offset of field: b2BodyDef::sleepThreshold"][::std::mem::offset_of!(b2BodyDef, sleepThreshold) - 44usize];
    ["Offset of field: b2BodyDef::name"][::std::mem::offset_of!(b2BodyDef, name) - 48usize];
    ["Offset of field: b2BodyDef::userData"][::std::mem::offset_of!(b2BodyDef, userData) - 56usize];
    ["Offset of field: b2BodyDef::motionLocks"][::std::mem::offset_of!(b2BodyDef, motionLocks) - 64usize];
    ["Offset of field: b2BodyDef::enableSleep"][::std::mem::offset_of!(b2BodyDef, enableSleep) - 67usize];
    ["Offset of field: b2BodyDef::isAwake"][::std::mem::offset_of!(b2BodyDef, isAwake) - 68usize];
    ["Offset of field: b2BodyDef::isBullet"][::std::mem::offset_of!(b2BodyDef, isBullet) - 69usize];
    ["Offset of field: b2BodyDef::isEnabled"][::std::mem::offset_of!(b2BodyDef, isEnabled) - 70usize];
    ["Offset of field: b2BodyDef::allowFastRotation"][::std::mem::offset_of!(b2BodyDef, allowFastRotation) - 71usize];
    ["Offset of field: b2BodyDef::internalValue"][::std::mem::offset_of!(b2BodyDef, internalValue) - 72usize];
};
#[doc = " This is used to filter collision on shapes. It affects shape-vs-shape collision\n and shape-versus-query collision (such as b2World_CastRay).\n @ingroup shape"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Filter {
    #[doc = " The collision category bits. Normally you would just set one bit. The category bits should\n represent your application object types. For example:\n @code{.cpp}\n enum MyCategories\n {\n    Static  = 0x00000001,\n    Dynamic = 0x00000002,\n    Debris  = 0x00000004,\n    Player  = 0x00000008,\n    // etc\n };\n @endcode"]
    pub categoryBits: u64,
    #[doc = " The collision mask bits. This states the categories that this\n shape would accept for collision.\n For example, you may want your player to only collide with static objects\n and other players.\n @code{.c}\n maskBits = Static | Player;\n @endcode"]
    pub maskBits: u64,
    #[doc = " Collision groups allow a certain group of objects to never collide (negative)\n or always collide (positive). A group index of zero has no effect. Non-zero group filtering\n always wins against the mask bits.\n For example, you may want ragdolls to collide with other ragdolls but you don't want\n ragdoll self-collision. In this case you would give each ragdoll a unique negative group index\n and apply that group index to all shapes on the ragdoll."]
    pub groupIndex: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Filter"][::std::mem::size_of::<b2Filter>() - 24usize];
    ["Alignment of b2Filter"][::std::mem::align_of::<b2Filter>() - 8usize];
    ["Offset of field: b2Filter::categoryBits"][::std::mem::offset_of!(b2Filter, categoryBits) - 0usize];
    ["Offset of field: b2Filter::maskBits"][::std::mem::offset_of!(b2Filter, maskBits) - 8usize];
    ["Offset of field: b2Filter::groupIndex"][::std::mem::offset_of!(b2Filter, groupIndex) - 16usize];
};
#[doc = " The query filter is used to filter collisions between queries and shapes. For example,\n you may want a ray-cast representing a projectile to hit players and the static environment\n but not debris.\n @ingroup shape"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2QueryFilter {
    #[doc = " The collision category bits of this query. Normally you would just set one bit."]
    pub categoryBits: u64,
    #[doc = " The collision mask bits. This states the shape categories that this\n query would accept for collision."]
    pub maskBits: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2QueryFilter"][::std::mem::size_of::<b2QueryFilter>() - 16usize];
    ["Alignment of b2QueryFilter"][::std::mem::align_of::<b2QueryFilter>() - 8usize];
    ["Offset of field: b2QueryFilter::categoryBits"][::std::mem::offset_of!(b2QueryFilter, categoryBits) - 0usize];
    ["Offset of field: b2QueryFilter::maskBits"][::std::mem::offset_of!(b2QueryFilter, maskBits) - 8usize];
};
#[doc = " A circle with an offset"]
pub const b2ShapeType_b2_circleShape: b2ShapeType = 0;
#[doc = " A capsule is an extruded circle"]
pub const b2ShapeType_b2_capsuleShape: b2ShapeType = 1;
#[doc = " A line segment"]
pub const b2ShapeType_b2_segmentShape: b2ShapeType = 2;
#[doc = " A convex polygon"]
pub const b2ShapeType_b2_polygonShape: b2ShapeType = 3;
#[doc = " A line segment owned by a chain shape"]
pub const b2ShapeType_b2_chainSegmentShape: b2ShapeType = 4;
#[doc = " The number of shape types"]
pub const b2ShapeType_b2_shapeTypeCount: b2ShapeType = 5;
#[doc = " Shape type\n @ingroup shape"]
pub type b2ShapeType = ::std::os::raw::c_uint;
#[doc = " Surface materials allow chain shapes to have per segment surface properties.\n @ingroup shape"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2SurfaceMaterial {
    #[doc = " The Coulomb (dry) friction coefficient, usually in the range [0,1]."]
    pub friction: f32,
    #[doc = " The coefficient of restitution (bounce) usually in the range [0,1].\n https://en.wikipedia.org/wiki/Coefficient_of_restitution"]
    pub restitution: f32,
    #[doc = " The rolling resistance usually in the range [0,1]."]
    pub rollingResistance: f32,
    #[doc = " The tangent speed for conveyor belts"]
    pub tangentSpeed: f32,
    #[doc = " User material identifier. This is passed with query results and to friction and restitution\n combining functions. It is not used internally."]
    pub userMaterialId: u64,
    #[doc = " Custom debug draw color."]
    pub customColor: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2SurfaceMaterial"][::std::mem::size_of::<b2SurfaceMaterial>() - 32usize];
    ["Alignment of b2SurfaceMaterial"][::std::mem::align_of::<b2SurfaceMaterial>() - 8usize];
    ["Offset of field: b2SurfaceMaterial::friction"][::std::mem::offset_of!(b2SurfaceMaterial, friction) - 0usize];
    ["Offset of field: b2SurfaceMaterial::restitution"]
        [::std::mem::offset_of!(b2SurfaceMaterial, restitution) - 4usize];
    ["Offset of field: b2SurfaceMaterial::rollingResistance"]
        [::std::mem::offset_of!(b2SurfaceMaterial, rollingResistance) - 8usize];
    ["Offset of field: b2SurfaceMaterial::tangentSpeed"]
        [::std::mem::offset_of!(b2SurfaceMaterial, tangentSpeed) - 12usize];
    ["Offset of field: b2SurfaceMaterial::userMaterialId"]
        [::std::mem::offset_of!(b2SurfaceMaterial, userMaterialId) - 16usize];
    ["Offset of field: b2SurfaceMaterial::customColor"]
        [::std::mem::offset_of!(b2SurfaceMaterial, customColor) - 24usize];
};
#[doc = " Used to create a shape.\n This is a temporary object used to bundle shape creation parameters. You may use\n the same shape definition to create multiple shapes.\n Must be initialized using b2DefaultShapeDef().\n @ingroup shape"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ShapeDef {
    #[doc = " Use this to store application specific shape data."]
    pub userData: *mut ::std::os::raw::c_void,
    #[doc = " The surface material for this shape."]
    pub material: b2SurfaceMaterial,
    #[doc = " The density, usually in kg/m^2.\n This is not part of the surface material because this is for the interior, which may have\n other considerations, such as being hollow. For example a wood barrel may be hollow or full of water."]
    pub density: f32,
    #[doc = " Collision filtering data."]
    pub filter: b2Filter,
    #[doc = " Enable custom filtering. Only one of the two shapes needs to enable custom filtering. See b2WorldDef."]
    pub enableCustomFiltering: bool,
    #[doc = " A sensor shape generates overlap events but never generates a collision response.\n Sensors do not have continuous collision. Instead, use a ray or shape cast for those scenarios.\n Sensors still contribute to the body mass if they have non-zero density.\n @note Sensor events are disabled by default.\n @see enableSensorEvents"]
    pub isSensor: bool,
    #[doc = " Enable sensor events for this shape. This applies to sensors and non-sensors. False by default, even for sensors."]
    pub enableSensorEvents: bool,
    #[doc = " Enable contact events for this shape. Only applies to kinematic and dynamic bodies. Ignored for sensors. False by default."]
    pub enableContactEvents: bool,
    #[doc = " Enable hit events for this shape. Only applies to kinematic and dynamic bodies. Ignored for sensors. False by default."]
    pub enableHitEvents: bool,
    #[doc = " Enable pre-solve contact events for this shape. Only applies to dynamic bodies. These are expensive\n and must be carefully handled due to multithreading. Ignored for sensors."]
    pub enablePreSolveEvents: bool,
    #[doc = " When shapes are created they will scan the environment for collision the next time step. This can significantly slow down\n static body creation when there are many static shapes.\n This is flag is ignored for dynamic and kinematic shapes which always invoke contact creation."]
    pub invokeContactCreation: bool,
    #[doc = " Should the body update the mass properties when this shape is created. Default is true."]
    pub updateBodyMass: bool,
    #[doc = " Used internally to detect a valid definition. DO NOT SET."]
    pub internalValue: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ShapeDef"][::std::mem::size_of::<b2ShapeDef>() - 88usize];
    ["Alignment of b2ShapeDef"][::std::mem::align_of::<b2ShapeDef>() - 8usize];
    ["Offset of field: b2ShapeDef::userData"][::std::mem::offset_of!(b2ShapeDef, userData) - 0usize];
    ["Offset of field: b2ShapeDef::material"][::std::mem::offset_of!(b2ShapeDef, material) - 8usize];
    ["Offset of field: b2ShapeDef::density"][::std::mem::offset_of!(b2ShapeDef, density) - 40usize];
    ["Offset of field: b2ShapeDef::filter"][::std::mem::offset_of!(b2ShapeDef, filter) - 48usize];
    ["Offset of field: b2ShapeDef::enableCustomFiltering"]
        [::std::mem::offset_of!(b2ShapeDef, enableCustomFiltering) - 72usize];
    ["Offset of field: b2ShapeDef::isSensor"][::std::mem::offset_of!(b2ShapeDef, isSensor) - 73usize];
    ["Offset of field: b2ShapeDef::enableSensorEvents"]
        [::std::mem::offset_of!(b2ShapeDef, enableSensorEvents) - 74usize];
    ["Offset of field: b2ShapeDef::enableContactEvents"]
        [::std::mem::offset_of!(b2ShapeDef, enableContactEvents) - 75usize];
    ["Offset of field: b2ShapeDef::enableHitEvents"][::std::mem::offset_of!(b2ShapeDef, enableHitEvents) - 76usize];
    ["Offset of field: b2ShapeDef::enablePreSolveEvents"]
        [::std::mem::offset_of!(b2ShapeDef, enablePreSolveEvents) - 77usize];
    ["Offset of field: b2ShapeDef::invokeContactCreation"]
        [::std::mem::offset_of!(b2ShapeDef, invokeContactCreation) - 78usize];
    ["Offset of field: b2ShapeDef::updateBodyMass"][::std::mem::offset_of!(b2ShapeDef, updateBodyMass) - 79usize];
    ["Offset of field: b2ShapeDef::internalValue"][::std::mem::offset_of!(b2ShapeDef, internalValue) - 80usize];
};
#[doc = " Used to create a chain of line segments. This is designed to eliminate ghost collisions with some limitations.\n - chains are one-sided\n - chains have no mass and should be used on static bodies\n - chains have a counter-clockwise winding order (normal points right of segment direction)\n - chains are either a loop or open\n - a chain must have at least 4 points\n - the distance between any two points must be greater than B2_LINEAR_SLOP\n - a chain shape should not self intersect (this is not validated)\n - an open chain shape has NO COLLISION on the first and final edge\n - you may overlap two open chains on their first three and/or last three points to get smooth collision\n - a chain shape creates multiple line segment shapes on the body\n https://en.wikipedia.org/wiki/Polygonal_chain\n Must be initialized using b2DefaultChainDef().\n @warning Do not use chain shapes unless you understand the limitations. This is an advanced feature.\n @ingroup shape"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ChainDef {
    #[doc = " Use this to store application specific shape data."]
    pub userData: *mut ::std::os::raw::c_void,
    #[doc = " An array of at least 4 points. These are cloned and may be temporary."]
    pub points: *const b2Vec2,
    #[doc = " The point count, must be 4 or more."]
    pub count: ::std::os::raw::c_int,
    #[doc = " Surface materials for each segment. These are cloned."]
    pub materials: *const b2SurfaceMaterial,
    #[doc = " The material count. Must be 1 or count. This allows you to provide one\n material for all segments or a unique material per segment."]
    pub materialCount: ::std::os::raw::c_int,
    #[doc = " Contact filtering data."]
    pub filter: b2Filter,
    #[doc = " Indicates a closed chain formed by connecting the first and last points"]
    pub isLoop: bool,
    #[doc = " Enable sensors to detect this chain. False by default."]
    pub enableSensorEvents: bool,
    #[doc = " Used internally to detect a valid definition. DO NOT SET."]
    pub internalValue: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ChainDef"][::std::mem::size_of::<b2ChainDef>() - 72usize];
    ["Alignment of b2ChainDef"][::std::mem::align_of::<b2ChainDef>() - 8usize];
    ["Offset of field: b2ChainDef::userData"][::std::mem::offset_of!(b2ChainDef, userData) - 0usize];
    ["Offset of field: b2ChainDef::points"][::std::mem::offset_of!(b2ChainDef, points) - 8usize];
    ["Offset of field: b2ChainDef::count"][::std::mem::offset_of!(b2ChainDef, count) - 16usize];
    ["Offset of field: b2ChainDef::materials"][::std::mem::offset_of!(b2ChainDef, materials) - 24usize];
    ["Offset of field: b2ChainDef::materialCount"][::std::mem::offset_of!(b2ChainDef, materialCount) - 32usize];
    ["Offset of field: b2ChainDef::filter"][::std::mem::offset_of!(b2ChainDef, filter) - 40usize];
    ["Offset of field: b2ChainDef::isLoop"][::std::mem::offset_of!(b2ChainDef, isLoop) - 64usize];
    ["Offset of field: b2ChainDef::enableSensorEvents"]
        [::std::mem::offset_of!(b2ChainDef, enableSensorEvents) - 65usize];
    ["Offset of field: b2ChainDef::internalValue"][::std::mem::offset_of!(b2ChainDef, internalValue) - 68usize];
};
#[doc = "! @cond\n Profiling data. Times are in milliseconds."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Profile {
    pub step: f32,
    pub pairs: f32,
    pub collide: f32,
    pub solve: f32,
    pub prepareStages: f32,
    pub solveConstraints: f32,
    pub prepareConstraints: f32,
    pub integrateVelocities: f32,
    pub warmStart: f32,
    pub solveImpulses: f32,
    pub integratePositions: f32,
    pub relaxImpulses: f32,
    pub applyRestitution: f32,
    pub storeImpulses: f32,
    pub splitIslands: f32,
    pub transforms: f32,
    pub sensorHits: f32,
    pub jointEvents: f32,
    pub hitEvents: f32,
    pub refit: f32,
    pub bullets: f32,
    pub sleepIslands: f32,
    pub sensors: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Profile"][::std::mem::size_of::<b2Profile>() - 92usize];
    ["Alignment of b2Profile"][::std::mem::align_of::<b2Profile>() - 4usize];
    ["Offset of field: b2Profile::step"][::std::mem::offset_of!(b2Profile, step) - 0usize];
    ["Offset of field: b2Profile::pairs"][::std::mem::offset_of!(b2Profile, pairs) - 4usize];
    ["Offset of field: b2Profile::collide"][::std::mem::offset_of!(b2Profile, collide) - 8usize];
    ["Offset of field: b2Profile::solve"][::std::mem::offset_of!(b2Profile, solve) - 12usize];
    ["Offset of field: b2Profile::prepareStages"][::std::mem::offset_of!(b2Profile, prepareStages) - 16usize];
    ["Offset of field: b2Profile::solveConstraints"][::std::mem::offset_of!(b2Profile, solveConstraints) - 20usize];
    ["Offset of field: b2Profile::prepareConstraints"][::std::mem::offset_of!(b2Profile, prepareConstraints) - 24usize];
    ["Offset of field: b2Profile::integrateVelocities"]
        [::std::mem::offset_of!(b2Profile, integrateVelocities) - 28usize];
    ["Offset of field: b2Profile::warmStart"][::std::mem::offset_of!(b2Profile, warmStart) - 32usize];
    ["Offset of field: b2Profile::solveImpulses"][::std::mem::offset_of!(b2Profile, solveImpulses) - 36usize];
    ["Offset of field: b2Profile::integratePositions"][::std::mem::offset_of!(b2Profile, integratePositions) - 40usize];
    ["Offset of field: b2Profile::relaxImpulses"][::std::mem::offset_of!(b2Profile, relaxImpulses) - 44usize];
    ["Offset of field: b2Profile::applyRestitution"][::std::mem::offset_of!(b2Profile, applyRestitution) - 48usize];
    ["Offset of field: b2Profile::storeImpulses"][::std::mem::offset_of!(b2Profile, storeImpulses) - 52usize];
    ["Offset of field: b2Profile::splitIslands"][::std::mem::offset_of!(b2Profile, splitIslands) - 56usize];
    ["Offset of field: b2Profile::transforms"][::std::mem::offset_of!(b2Profile, transforms) - 60usize];
    ["Offset of field: b2Profile::sensorHits"][::std::mem::offset_of!(b2Profile, sensorHits) - 64usize];
    ["Offset of field: b2Profile::jointEvents"][::std::mem::offset_of!(b2Profile, jointEvents) - 68usize];
    ["Offset of field: b2Profile::hitEvents"][::std::mem::offset_of!(b2Profile, hitEvents) - 72usize];
    ["Offset of field: b2Profile::refit"][::std::mem::offset_of!(b2Profile, refit) - 76usize];
    ["Offset of field: b2Profile::bullets"][::std::mem::offset_of!(b2Profile, bullets) - 80usize];
    ["Offset of field: b2Profile::sleepIslands"][::std::mem::offset_of!(b2Profile, sleepIslands) - 84usize];
    ["Offset of field: b2Profile::sensors"][::std::mem::offset_of!(b2Profile, sensors) - 88usize];
};
#[doc = " Counters that give details of the simulation size."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2Counters {
    pub bodyCount: ::std::os::raw::c_int,
    pub shapeCount: ::std::os::raw::c_int,
    pub contactCount: ::std::os::raw::c_int,
    pub jointCount: ::std::os::raw::c_int,
    pub islandCount: ::std::os::raw::c_int,
    pub stackUsed: ::std::os::raw::c_int,
    pub staticTreeHeight: ::std::os::raw::c_int,
    pub treeHeight: ::std::os::raw::c_int,
    pub byteCount: ::std::os::raw::c_int,
    pub taskCount: ::std::os::raw::c_int,
    pub colorCounts: [::std::os::raw::c_int; 24usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2Counters"][::std::mem::size_of::<b2Counters>() - 136usize];
    ["Alignment of b2Counters"][::std::mem::align_of::<b2Counters>() - 4usize];
    ["Offset of field: b2Counters::bodyCount"][::std::mem::offset_of!(b2Counters, bodyCount) - 0usize];
    ["Offset of field: b2Counters::shapeCount"][::std::mem::offset_of!(b2Counters, shapeCount) - 4usize];
    ["Offset of field: b2Counters::contactCount"][::std::mem::offset_of!(b2Counters, contactCount) - 8usize];
    ["Offset of field: b2Counters::jointCount"][::std::mem::offset_of!(b2Counters, jointCount) - 12usize];
    ["Offset of field: b2Counters::islandCount"][::std::mem::offset_of!(b2Counters, islandCount) - 16usize];
    ["Offset of field: b2Counters::stackUsed"][::std::mem::offset_of!(b2Counters, stackUsed) - 20usize];
    ["Offset of field: b2Counters::staticTreeHeight"][::std::mem::offset_of!(b2Counters, staticTreeHeight) - 24usize];
    ["Offset of field: b2Counters::treeHeight"][::std::mem::offset_of!(b2Counters, treeHeight) - 28usize];
    ["Offset of field: b2Counters::byteCount"][::std::mem::offset_of!(b2Counters, byteCount) - 32usize];
    ["Offset of field: b2Counters::taskCount"][::std::mem::offset_of!(b2Counters, taskCount) - 36usize];
    ["Offset of field: b2Counters::colorCounts"][::std::mem::offset_of!(b2Counters, colorCounts) - 40usize];
};
pub const b2JointType_b2_distanceJoint: b2JointType = 0;
pub const b2JointType_b2_filterJoint: b2JointType = 1;
pub const b2JointType_b2_motorJoint: b2JointType = 2;
pub const b2JointType_b2_prismaticJoint: b2JointType = 3;
pub const b2JointType_b2_revoluteJoint: b2JointType = 4;
pub const b2JointType_b2_weldJoint: b2JointType = 5;
pub const b2JointType_b2_wheelJoint: b2JointType = 6;
#[doc = " Joint type enumeration\n\n This is useful because all joint types use b2JointId and sometimes you\n want to get the type of a joint.\n @ingroup joint"]
pub type b2JointType = ::std::os::raw::c_uint;
#[doc = " Base joint definition used by all joint types.\n The local frames are measured from the body's origin rather than the center of mass because:\n 1. you might not know where the center of mass will be\n 2. if you add/remove shapes from a body and recompute the mass, the joints will be broken"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2JointDef {
    #[doc = " User data pointer"]
    pub userData: *mut ::std::os::raw::c_void,
    #[doc = " The first attached body"]
    pub bodyIdA: b2BodyId,
    #[doc = " The second attached body"]
    pub bodyIdB: b2BodyId,
    #[doc = " The first local joint frame"]
    pub localFrameA: b2Transform,
    #[doc = " The second local joint frame"]
    pub localFrameB: b2Transform,
    #[doc = " Force threshold for joint events"]
    pub forceThreshold: f32,
    #[doc = " Torque threshold for joint events"]
    pub torqueThreshold: f32,
    #[doc = " Constraint hertz (advanced feature)"]
    pub constraintHertz: f32,
    #[doc = " Constraint damping ratio (advanced feature)"]
    pub constraintDampingRatio: f32,
    #[doc = " Debug draw scale"]
    pub drawScale: f32,
    #[doc = " Set this flag to true if the attached bodies should collide"]
    pub collideConnected: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2JointDef"][::std::mem::size_of::<b2JointDef>() - 80usize];
    ["Alignment of b2JointDef"][::std::mem::align_of::<b2JointDef>() - 8usize];
    ["Offset of field: b2JointDef::userData"][::std::mem::offset_of!(b2JointDef, userData) - 0usize];
    ["Offset of field: b2JointDef::bodyIdA"][::std::mem::offset_of!(b2JointDef, bodyIdA) - 8usize];
    ["Offset of field: b2JointDef::bodyIdB"][::std::mem::offset_of!(b2JointDef, bodyIdB) - 16usize];
    ["Offset of field: b2JointDef::localFrameA"][::std::mem::offset_of!(b2JointDef, localFrameA) - 24usize];
    ["Offset of field: b2JointDef::localFrameB"][::std::mem::offset_of!(b2JointDef, localFrameB) - 40usize];
    ["Offset of field: b2JointDef::forceThreshold"][::std::mem::offset_of!(b2JointDef, forceThreshold) - 56usize];
    ["Offset of field: b2JointDef::torqueThreshold"][::std::mem::offset_of!(b2JointDef, torqueThreshold) - 60usize];
    ["Offset of field: b2JointDef::constraintHertz"][::std::mem::offset_of!(b2JointDef, constraintHertz) - 64usize];
    ["Offset of field: b2JointDef::constraintDampingRatio"]
        [::std::mem::offset_of!(b2JointDef, constraintDampingRatio) - 68usize];
    ["Offset of field: b2JointDef::drawScale"][::std::mem::offset_of!(b2JointDef, drawScale) - 72usize];
    ["Offset of field: b2JointDef::collideConnected"][::std::mem::offset_of!(b2JointDef, collideConnected) - 76usize];
};
#[doc = " Distance joint definition\n Connects a point on body A with a point on body B by a segment.\n Useful for ropes and springs.\n @ingroup distance_joint"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2DistanceJointDef {
    #[doc = " Base joint definition"]
    pub base: b2JointDef,
    #[doc = " The rest length of this joint. Clamped to a stable minimum value."]
    pub length: f32,
    #[doc = " Enable the distance constraint to behave like a spring. If false\n then the distance joint will be rigid, overriding the limit and motor."]
    pub enableSpring: bool,
    #[doc = " The lower spring force controls how much tension it can sustain"]
    pub lowerSpringForce: f32,
    #[doc = " The upper spring force controls how much compression it an sustain"]
    pub upperSpringForce: f32,
    #[doc = " The spring linear stiffness Hertz, cycles per second"]
    pub hertz: f32,
    #[doc = " The spring linear damping ratio, non-dimensional"]
    pub dampingRatio: f32,
    #[doc = " Enable/disable the joint limit"]
    pub enableLimit: bool,
    #[doc = " Minimum length. Clamped to a stable minimum value."]
    pub minLength: f32,
    #[doc = " Maximum length. Must be greater than or equal to the minimum length."]
    pub maxLength: f32,
    #[doc = " Enable/disable the joint motor"]
    pub enableMotor: bool,
    #[doc = " The maximum motor force, usually in newtons"]
    pub maxMotorForce: f32,
    #[doc = " The desired motor speed, usually in meters per second"]
    pub motorSpeed: f32,
    #[doc = " Used internally to detect a valid definition. DO NOT SET."]
    pub internalValue: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2DistanceJointDef"][::std::mem::size_of::<b2DistanceJointDef>() - 136usize];
    ["Alignment of b2DistanceJointDef"][::std::mem::align_of::<b2DistanceJointDef>() - 8usize];
    ["Offset of field: b2DistanceJointDef::base"][::std::mem::offset_of!(b2DistanceJointDef, base) - 0usize];
    ["Offset of field: b2DistanceJointDef::length"][::std::mem::offset_of!(b2DistanceJointDef, length) - 80usize];
    ["Offset of field: b2DistanceJointDef::enableSpring"]
        [::std::mem::offset_of!(b2DistanceJointDef, enableSpring) - 84usize];
    ["Offset of field: b2DistanceJointDef::lowerSpringForce"]
        [::std::mem::offset_of!(b2DistanceJointDef, lowerSpringForce) - 88usize];
    ["Offset of field: b2DistanceJointDef::upperSpringForce"]
        [::std::mem::offset_of!(b2DistanceJointDef, upperSpringForce) - 92usize];
    ["Offset of field: b2DistanceJointDef::hertz"][::std::mem::offset_of!(b2DistanceJointDef, hertz) - 96usize];
    ["Offset of field: b2DistanceJointDef::dampingRatio"]
        [::std::mem::offset_of!(b2DistanceJointDef, dampingRatio) - 100usize];
    ["Offset of field: b2DistanceJointDef::enableLimit"]
        [::std::mem::offset_of!(b2DistanceJointDef, enableLimit) - 104usize];
    ["Offset of field: b2DistanceJointDef::minLength"]
        [::std::mem::offset_of!(b2DistanceJointDef, minLength) - 108usize];
    ["Offset of field: b2DistanceJointDef::maxLength"]
        [::std::mem::offset_of!(b2DistanceJointDef, maxLength) - 112usize];
    ["Offset of field: b2DistanceJointDef::enableMotor"]
        [::std::mem::offset_of!(b2DistanceJointDef, enableMotor) - 116usize];
    ["Offset of field: b2DistanceJointDef::maxMotorForce"]
        [::std::mem::offset_of!(b2DistanceJointDef, maxMotorForce) - 120usize];
    ["Offset of field: b2DistanceJointDef::motorSpeed"]
        [::std::mem::offset_of!(b2DistanceJointDef, motorSpeed) - 124usize];
    ["Offset of field: b2DistanceJointDef::internalValue"]
        [::std::mem::offset_of!(b2DistanceJointDef, internalValue) - 128usize];
};
#[doc = " A motor joint is used to control the relative velocity and or transform between two bodies.\n With a velocity of zero this acts like top-down friction.\n @ingroup motor_joint"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2MotorJointDef {
    #[doc = " Base joint definition"]
    pub base: b2JointDef,
    #[doc = " The desired linear velocity"]
    pub linearVelocity: b2Vec2,
    #[doc = " The maximum motor force in newtons"]
    pub maxVelocityForce: f32,
    #[doc = " The desired angular velocity"]
    pub angularVelocity: f32,
    #[doc = " The maximum motor torque in newton-meters"]
    pub maxVelocityTorque: f32,
    #[doc = " Linear spring hertz for position control"]
    pub linearHertz: f32,
    #[doc = " Linear spring damping ratio"]
    pub linearDampingRatio: f32,
    #[doc = " Maximum spring force in newtons"]
    pub maxSpringForce: f32,
    #[doc = " Angular spring hertz for position control"]
    pub angularHertz: f32,
    #[doc = " Angular spring damping ratio"]
    pub angularDampingRatio: f32,
    #[doc = " Maximum spring torque in newton-meters"]
    pub maxSpringTorque: f32,
    #[doc = " Used internally to detect a valid definition. DO NOT SET."]
    pub internalValue: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2MotorJointDef"][::std::mem::size_of::<b2MotorJointDef>() - 128usize];
    ["Alignment of b2MotorJointDef"][::std::mem::align_of::<b2MotorJointDef>() - 8usize];
    ["Offset of field: b2MotorJointDef::base"][::std::mem::offset_of!(b2MotorJointDef, base) - 0usize];
    ["Offset of field: b2MotorJointDef::linearVelocity"]
        [::std::mem::offset_of!(b2MotorJointDef, linearVelocity) - 80usize];
    ["Offset of field: b2MotorJointDef::maxVelocityForce"]
        [::std::mem::offset_of!(b2MotorJointDef, maxVelocityForce) - 88usize];
    ["Offset of field: b2MotorJointDef::angularVelocity"]
        [::std::mem::offset_of!(b2MotorJointDef, angularVelocity) - 92usize];
    ["Offset of field: b2MotorJointDef::maxVelocityTorque"]
        [::std::mem::offset_of!(b2MotorJointDef, maxVelocityTorque) - 96usize];
    ["Offset of field: b2MotorJointDef::linearHertz"][::std::mem::offset_of!(b2MotorJointDef, linearHertz) - 100usize];
    ["Offset of field: b2MotorJointDef::linearDampingRatio"]
        [::std::mem::offset_of!(b2MotorJointDef, linearDampingRatio) - 104usize];
    ["Offset of field: b2MotorJointDef::maxSpringForce"]
        [::std::mem::offset_of!(b2MotorJointDef, maxSpringForce) - 108usize];
    ["Offset of field: b2MotorJointDef::angularHertz"]
        [::std::mem::offset_of!(b2MotorJointDef, angularHertz) - 112usize];
    ["Offset of field: b2MotorJointDef::angularDampingRatio"]
        [::std::mem::offset_of!(b2MotorJointDef, angularDampingRatio) - 116usize];
    ["Offset of field: b2MotorJointDef::maxSpringTorque"]
        [::std::mem::offset_of!(b2MotorJointDef, maxSpringTorque) - 120usize];
    ["Offset of field: b2MotorJointDef::internalValue"]
        [::std::mem::offset_of!(b2MotorJointDef, internalValue) - 124usize];
};
#[doc = " A filter joint is used to disable collision between two specific bodies.\n\n @ingroup filter_joint"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2FilterJointDef {
    #[doc = " Base joint definition"]
    pub base: b2JointDef,
    #[doc = " Used internally to detect a valid definition. DO NOT SET."]
    pub internalValue: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2FilterJointDef"][::std::mem::size_of::<b2FilterJointDef>() - 88usize];
    ["Alignment of b2FilterJointDef"][::std::mem::align_of::<b2FilterJointDef>() - 8usize];
    ["Offset of field: b2FilterJointDef::base"][::std::mem::offset_of!(b2FilterJointDef, base) - 0usize];
    ["Offset of field: b2FilterJointDef::internalValue"]
        [::std::mem::offset_of!(b2FilterJointDef, internalValue) - 80usize];
};
#[doc = " Prismatic joint definition\n Body B may slide along the x-axis in local frame A. Body B cannot rotate relative to body A.\n The joint translation is zero when the local frame origins coincide in world space.\n @ingroup prismatic_joint"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2PrismaticJointDef {
    #[doc = " Base joint definition"]
    pub base: b2JointDef,
    #[doc = " Enable a linear spring along the prismatic joint axis"]
    pub enableSpring: bool,
    #[doc = " The spring stiffness Hertz, cycles per second"]
    pub hertz: f32,
    #[doc = " The spring damping ratio, non-dimensional"]
    pub dampingRatio: f32,
    #[doc = " The target translation for the joint in meters. The spring-damper will drive\n to this translation."]
    pub targetTranslation: f32,
    #[doc = " Enable/disable the joint limit"]
    pub enableLimit: bool,
    #[doc = " The lower translation limit"]
    pub lowerTranslation: f32,
    #[doc = " The upper translation limit"]
    pub upperTranslation: f32,
    #[doc = " Enable/disable the joint motor"]
    pub enableMotor: bool,
    #[doc = " The maximum motor force, typically in newtons"]
    pub maxMotorForce: f32,
    #[doc = " The desired motor speed, typically in meters per second"]
    pub motorSpeed: f32,
    #[doc = " Used internally to detect a valid definition. DO NOT SET."]
    pub internalValue: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2PrismaticJointDef"][::std::mem::size_of::<b2PrismaticJointDef>() - 128usize];
    ["Alignment of b2PrismaticJointDef"][::std::mem::align_of::<b2PrismaticJointDef>() - 8usize];
    ["Offset of field: b2PrismaticJointDef::base"][::std::mem::offset_of!(b2PrismaticJointDef, base) - 0usize];
    ["Offset of field: b2PrismaticJointDef::enableSpring"]
        [::std::mem::offset_of!(b2PrismaticJointDef, enableSpring) - 80usize];
    ["Offset of field: b2PrismaticJointDef::hertz"][::std::mem::offset_of!(b2PrismaticJointDef, hertz) - 84usize];
    ["Offset of field: b2PrismaticJointDef::dampingRatio"]
        [::std::mem::offset_of!(b2PrismaticJointDef, dampingRatio) - 88usize];
    ["Offset of field: b2PrismaticJointDef::targetTranslation"]
        [::std::mem::offset_of!(b2PrismaticJointDef, targetTranslation) - 92usize];
    ["Offset of field: b2PrismaticJointDef::enableLimit"]
        [::std::mem::offset_of!(b2PrismaticJointDef, enableLimit) - 96usize];
    ["Offset of field: b2PrismaticJointDef::lowerTranslation"]
        [::std::mem::offset_of!(b2PrismaticJointDef, lowerTranslation) - 100usize];
    ["Offset of field: b2PrismaticJointDef::upperTranslation"]
        [::std::mem::offset_of!(b2PrismaticJointDef, upperTranslation) - 104usize];
    ["Offset of field: b2PrismaticJointDef::enableMotor"]
        [::std::mem::offset_of!(b2PrismaticJointDef, enableMotor) - 108usize];
    ["Offset of field: b2PrismaticJointDef::maxMotorForce"]
        [::std::mem::offset_of!(b2PrismaticJointDef, maxMotorForce) - 112usize];
    ["Offset of field: b2PrismaticJointDef::motorSpeed"]
        [::std::mem::offset_of!(b2PrismaticJointDef, motorSpeed) - 116usize];
    ["Offset of field: b2PrismaticJointDef::internalValue"]
        [::std::mem::offset_of!(b2PrismaticJointDef, internalValue) - 120usize];
};
#[doc = " Revolute joint definition\n A point on body B is fixed to a point on body A. Allows relative rotation.\n @ingroup revolute_joint"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2RevoluteJointDef {
    #[doc = " Base joint definition"]
    pub base: b2JointDef,
    #[doc = " The target angle for the joint in radians. The spring-damper will drive\n to this angle."]
    pub targetAngle: f32,
    #[doc = " Enable a rotational spring on the revolute hinge axis"]
    pub enableSpring: bool,
    #[doc = " The spring stiffness Hertz, cycles per second"]
    pub hertz: f32,
    #[doc = " The spring damping ratio, non-dimensional"]
    pub dampingRatio: f32,
    #[doc = " A flag to enable joint limits"]
    pub enableLimit: bool,
    #[doc = " The lower angle for the joint limit in radians. Minimum of -0.99*pi radians."]
    pub lowerAngle: f32,
    #[doc = " The upper angle for the joint limit in radians. Maximum of 0.99*pi radians."]
    pub upperAngle: f32,
    #[doc = " A flag to enable the joint motor"]
    pub enableMotor: bool,
    #[doc = " The maximum motor torque, typically in newton-meters"]
    pub maxMotorTorque: f32,
    #[doc = " The desired motor speed in radians per second"]
    pub motorSpeed: f32,
    #[doc = " Used internally to detect a valid definition. DO NOT SET."]
    pub internalValue: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2RevoluteJointDef"][::std::mem::size_of::<b2RevoluteJointDef>() - 128usize];
    ["Alignment of b2RevoluteJointDef"][::std::mem::align_of::<b2RevoluteJointDef>() - 8usize];
    ["Offset of field: b2RevoluteJointDef::base"][::std::mem::offset_of!(b2RevoluteJointDef, base) - 0usize];
    ["Offset of field: b2RevoluteJointDef::targetAngle"]
        [::std::mem::offset_of!(b2RevoluteJointDef, targetAngle) - 80usize];
    ["Offset of field: b2RevoluteJointDef::enableSpring"]
        [::std::mem::offset_of!(b2RevoluteJointDef, enableSpring) - 84usize];
    ["Offset of field: b2RevoluteJointDef::hertz"][::std::mem::offset_of!(b2RevoluteJointDef, hertz) - 88usize];
    ["Offset of field: b2RevoluteJointDef::dampingRatio"]
        [::std::mem::offset_of!(b2RevoluteJointDef, dampingRatio) - 92usize];
    ["Offset of field: b2RevoluteJointDef::enableLimit"]
        [::std::mem::offset_of!(b2RevoluteJointDef, enableLimit) - 96usize];
    ["Offset of field: b2RevoluteJointDef::lowerAngle"]
        [::std::mem::offset_of!(b2RevoluteJointDef, lowerAngle) - 100usize];
    ["Offset of field: b2RevoluteJointDef::upperAngle"]
        [::std::mem::offset_of!(b2RevoluteJointDef, upperAngle) - 104usize];
    ["Offset of field: b2RevoluteJointDef::enableMotor"]
        [::std::mem::offset_of!(b2RevoluteJointDef, enableMotor) - 108usize];
    ["Offset of field: b2RevoluteJointDef::maxMotorTorque"]
        [::std::mem::offset_of!(b2RevoluteJointDef, maxMotorTorque) - 112usize];
    ["Offset of field: b2RevoluteJointDef::motorSpeed"]
        [::std::mem::offset_of!(b2RevoluteJointDef, motorSpeed) - 116usize];
    ["Offset of field: b2RevoluteJointDef::internalValue"]
        [::std::mem::offset_of!(b2RevoluteJointDef, internalValue) - 120usize];
};
#[doc = " Weld joint definition\n Connects two bodies together rigidly. This constraint provides springs to mimic\n soft-body simulation.\n @note The approximate solver in Box2D cannot hold many bodies together rigidly\n @ingroup weld_joint"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2WeldJointDef {
    #[doc = " Base joint definition"]
    pub base: b2JointDef,
    #[doc = " Linear stiffness expressed as Hertz (cycles per second). Use zero for maximum stiffness."]
    pub linearHertz: f32,
    #[doc = " Angular stiffness as Hertz (cycles per second). Use zero for maximum stiffness."]
    pub angularHertz: f32,
    #[doc = " Linear damping ratio, non-dimensional. Use 1 for critical damping."]
    pub linearDampingRatio: f32,
    #[doc = " Linear damping ratio, non-dimensional. Use 1 for critical damping."]
    pub angularDampingRatio: f32,
    #[doc = " Used internally to detect a valid definition. DO NOT SET."]
    pub internalValue: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2WeldJointDef"][::std::mem::size_of::<b2WeldJointDef>() - 104usize];
    ["Alignment of b2WeldJointDef"][::std::mem::align_of::<b2WeldJointDef>() - 8usize];
    ["Offset of field: b2WeldJointDef::base"][::std::mem::offset_of!(b2WeldJointDef, base) - 0usize];
    ["Offset of field: b2WeldJointDef::linearHertz"][::std::mem::offset_of!(b2WeldJointDef, linearHertz) - 80usize];
    ["Offset of field: b2WeldJointDef::angularHertz"][::std::mem::offset_of!(b2WeldJointDef, angularHertz) - 84usize];
    ["Offset of field: b2WeldJointDef::linearDampingRatio"]
        [::std::mem::offset_of!(b2WeldJointDef, linearDampingRatio) - 88usize];
    ["Offset of field: b2WeldJointDef::angularDampingRatio"]
        [::std::mem::offset_of!(b2WeldJointDef, angularDampingRatio) - 92usize];
    ["Offset of field: b2WeldJointDef::internalValue"][::std::mem::offset_of!(b2WeldJointDef, internalValue) - 96usize];
};
#[doc = " Wheel joint definition\n Body B is a wheel that may rotate freely and slide along the local x-axis in frame A.\n The joint translation is zero when the local frame origins coincide in world space.\n @ingroup wheel_joint"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2WheelJointDef {
    #[doc = " Base joint definition"]
    pub base: b2JointDef,
    #[doc = " Enable a linear spring along the local axis"]
    pub enableSpring: bool,
    #[doc = " Spring stiffness in Hertz"]
    pub hertz: f32,
    #[doc = " Spring damping ratio, non-dimensional"]
    pub dampingRatio: f32,
    #[doc = " Enable/disable the joint linear limit"]
    pub enableLimit: bool,
    #[doc = " The lower translation limit"]
    pub lowerTranslation: f32,
    #[doc = " The upper translation limit"]
    pub upperTranslation: f32,
    #[doc = " Enable/disable the joint rotational motor"]
    pub enableMotor: bool,
    #[doc = " The maximum motor torque, typically in newton-meters"]
    pub maxMotorTorque: f32,
    #[doc = " The desired motor speed in radians per second"]
    pub motorSpeed: f32,
    #[doc = " Used internally to detect a valid definition. DO NOT SET."]
    pub internalValue: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2WheelJointDef"][::std::mem::size_of::<b2WheelJointDef>() - 120usize];
    ["Alignment of b2WheelJointDef"][::std::mem::align_of::<b2WheelJointDef>() - 8usize];
    ["Offset of field: b2WheelJointDef::base"][::std::mem::offset_of!(b2WheelJointDef, base) - 0usize];
    ["Offset of field: b2WheelJointDef::enableSpring"][::std::mem::offset_of!(b2WheelJointDef, enableSpring) - 80usize];
    ["Offset of field: b2WheelJointDef::hertz"][::std::mem::offset_of!(b2WheelJointDef, hertz) - 84usize];
    ["Offset of field: b2WheelJointDef::dampingRatio"][::std::mem::offset_of!(b2WheelJointDef, dampingRatio) - 88usize];
    ["Offset of field: b2WheelJointDef::enableLimit"][::std::mem::offset_of!(b2WheelJointDef, enableLimit) - 92usize];
    ["Offset of field: b2WheelJointDef::lowerTranslation"]
        [::std::mem::offset_of!(b2WheelJointDef, lowerTranslation) - 96usize];
    ["Offset of field: b2WheelJointDef::upperTranslation"]
        [::std::mem::offset_of!(b2WheelJointDef, upperTranslation) - 100usize];
    ["Offset of field: b2WheelJointDef::enableMotor"][::std::mem::offset_of!(b2WheelJointDef, enableMotor) - 104usize];
    ["Offset of field: b2WheelJointDef::maxMotorTorque"]
        [::std::mem::offset_of!(b2WheelJointDef, maxMotorTorque) - 108usize];
    ["Offset of field: b2WheelJointDef::motorSpeed"][::std::mem::offset_of!(b2WheelJointDef, motorSpeed) - 112usize];
    ["Offset of field: b2WheelJointDef::internalValue"]
        [::std::mem::offset_of!(b2WheelJointDef, internalValue) - 116usize];
};
#[doc = " The explosion definition is used to configure options for explosions. Explosions\n consider shape geometry when computing the impulse.\n @ingroup world"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ExplosionDef {
    #[doc = " Mask bits to filter shapes"]
    pub maskBits: u64,
    #[doc = " The center of the explosion in world space"]
    pub position: b2Vec2,
    #[doc = " The radius of the explosion"]
    pub radius: f32,
    #[doc = " The falloff distance beyond the radius. Impulse is reduced to zero at this distance."]
    pub falloff: f32,
    #[doc = " Impulse per unit length. This applies an impulse according to the shape perimeter that\n is facing the explosion. Explosions only apply to circles, capsules, and polygons. This\n may be negative for implosions."]
    pub impulsePerLength: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ExplosionDef"][::std::mem::size_of::<b2ExplosionDef>() - 32usize];
    ["Alignment of b2ExplosionDef"][::std::mem::align_of::<b2ExplosionDef>() - 8usize];
    ["Offset of field: b2ExplosionDef::maskBits"][::std::mem::offset_of!(b2ExplosionDef, maskBits) - 0usize];
    ["Offset of field: b2ExplosionDef::position"][::std::mem::offset_of!(b2ExplosionDef, position) - 8usize];
    ["Offset of field: b2ExplosionDef::radius"][::std::mem::offset_of!(b2ExplosionDef, radius) - 16usize];
    ["Offset of field: b2ExplosionDef::falloff"][::std::mem::offset_of!(b2ExplosionDef, falloff) - 20usize];
    ["Offset of field: b2ExplosionDef::impulsePerLength"]
        [::std::mem::offset_of!(b2ExplosionDef, impulsePerLength) - 24usize];
};
#[doc = " A begin touch event is generated when a shape starts to overlap a sensor shape."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2SensorBeginTouchEvent {
    #[doc = " The id of the sensor shape"]
    pub sensorShapeId: b2ShapeId,
    #[doc = " The id of the shape that began touching the sensor shape"]
    pub visitorShapeId: b2ShapeId,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2SensorBeginTouchEvent"][::std::mem::size_of::<b2SensorBeginTouchEvent>() - 16usize];
    ["Alignment of b2SensorBeginTouchEvent"][::std::mem::align_of::<b2SensorBeginTouchEvent>() - 4usize];
    ["Offset of field: b2SensorBeginTouchEvent::sensorShapeId"]
        [::std::mem::offset_of!(b2SensorBeginTouchEvent, sensorShapeId) - 0usize];
    ["Offset of field: b2SensorBeginTouchEvent::visitorShapeId"]
        [::std::mem::offset_of!(b2SensorBeginTouchEvent, visitorShapeId) - 8usize];
};
#[doc = " An end touch event is generated when a shape stops overlapping a sensor shape.\n\tThese include things like setting the transform, destroying a body or shape, or changing\n\ta filter. You will also get an end event if the sensor or visitor are destroyed.\n\tTherefore you should always confirm the shape id is valid using b2Shape_IsValid."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2SensorEndTouchEvent {
    #[doc = " The id of the sensor shape\n\t@warning this shape may have been destroyed\n\t@see b2Shape_IsValid"]
    pub sensorShapeId: b2ShapeId,
    #[doc = " The id of the shape that stopped touching the sensor shape\n\t@warning this shape may have been destroyed\n\t@see b2Shape_IsValid"]
    pub visitorShapeId: b2ShapeId,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2SensorEndTouchEvent"][::std::mem::size_of::<b2SensorEndTouchEvent>() - 16usize];
    ["Alignment of b2SensorEndTouchEvent"][::std::mem::align_of::<b2SensorEndTouchEvent>() - 4usize];
    ["Offset of field: b2SensorEndTouchEvent::sensorShapeId"]
        [::std::mem::offset_of!(b2SensorEndTouchEvent, sensorShapeId) - 0usize];
    ["Offset of field: b2SensorEndTouchEvent::visitorShapeId"]
        [::std::mem::offset_of!(b2SensorEndTouchEvent, visitorShapeId) - 8usize];
};
#[doc = " Sensor events are buffered in the world and are available\n as begin/end overlap event arrays after the time step is complete.\n Note: these may become invalid if bodies and/or shapes are destroyed"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2SensorEvents {
    #[doc = " Array of sensor begin touch events"]
    pub beginEvents: *mut b2SensorBeginTouchEvent,
    #[doc = " Array of sensor end touch events"]
    pub endEvents: *mut b2SensorEndTouchEvent,
    #[doc = " The number of begin touch events"]
    pub beginCount: ::std::os::raw::c_int,
    #[doc = " The number of end touch events"]
    pub endCount: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2SensorEvents"][::std::mem::size_of::<b2SensorEvents>() - 24usize];
    ["Alignment of b2SensorEvents"][::std::mem::align_of::<b2SensorEvents>() - 8usize];
    ["Offset of field: b2SensorEvents::beginEvents"][::std::mem::offset_of!(b2SensorEvents, beginEvents) - 0usize];
    ["Offset of field: b2SensorEvents::endEvents"][::std::mem::offset_of!(b2SensorEvents, endEvents) - 8usize];
    ["Offset of field: b2SensorEvents::beginCount"][::std::mem::offset_of!(b2SensorEvents, beginCount) - 16usize];
    ["Offset of field: b2SensorEvents::endCount"][::std::mem::offset_of!(b2SensorEvents, endCount) - 20usize];
};
#[doc = " A begin touch event is generated when two shapes begin touching."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ContactBeginTouchEvent {
    #[doc = " Id of the first shape"]
    pub shapeIdA: b2ShapeId,
    #[doc = " Id of the second shape"]
    pub shapeIdB: b2ShapeId,
    #[doc = " The transient contact id. This contact maybe destroyed automatically when the world is modified or simulated.\n Used b2Contact_IsValid before using this id."]
    pub contactId: b2ContactId,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ContactBeginTouchEvent"][::std::mem::size_of::<b2ContactBeginTouchEvent>() - 28usize];
    ["Alignment of b2ContactBeginTouchEvent"][::std::mem::align_of::<b2ContactBeginTouchEvent>() - 4usize];
    ["Offset of field: b2ContactBeginTouchEvent::shapeIdA"]
        [::std::mem::offset_of!(b2ContactBeginTouchEvent, shapeIdA) - 0usize];
    ["Offset of field: b2ContactBeginTouchEvent::shapeIdB"]
        [::std::mem::offset_of!(b2ContactBeginTouchEvent, shapeIdB) - 8usize];
    ["Offset of field: b2ContactBeginTouchEvent::contactId"]
        [::std::mem::offset_of!(b2ContactBeginTouchEvent, contactId) - 16usize];
};
#[doc = " An end touch event is generated when two shapes stop touching.\n\tYou will get an end event if you do anything that destroys contacts previous to the last\n\tworld step. These include things like setting the transform, destroying a body\n\tor shape, or changing a filter or body type."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ContactEndTouchEvent {
    #[doc = " Id of the first shape\n\t@warning this shape may have been destroyed\n\t@see b2Shape_IsValid"]
    pub shapeIdA: b2ShapeId,
    #[doc = " Id of the second shape\n\t@warning this shape may have been destroyed\n\t@see b2Shape_IsValid"]
    pub shapeIdB: b2ShapeId,
    #[doc = " Id of the contact.\n\t@warning this contact may have been destroyed\n\t@see b2Contact_IsValid"]
    pub contactId: b2ContactId,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ContactEndTouchEvent"][::std::mem::size_of::<b2ContactEndTouchEvent>() - 28usize];
    ["Alignment of b2ContactEndTouchEvent"][::std::mem::align_of::<b2ContactEndTouchEvent>() - 4usize];
    ["Offset of field: b2ContactEndTouchEvent::shapeIdA"]
        [::std::mem::offset_of!(b2ContactEndTouchEvent, shapeIdA) - 0usize];
    ["Offset of field: b2ContactEndTouchEvent::shapeIdB"]
        [::std::mem::offset_of!(b2ContactEndTouchEvent, shapeIdB) - 8usize];
    ["Offset of field: b2ContactEndTouchEvent::contactId"]
        [::std::mem::offset_of!(b2ContactEndTouchEvent, contactId) - 16usize];
};
#[doc = " A hit touch event is generated when two shapes collide with a speed faster than the hit speed threshold.\n This may be reported for speculative contacts that have a confirmed impulse."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ContactHitEvent {
    #[doc = " Id of the first shape"]
    pub shapeIdA: b2ShapeId,
    #[doc = " Id of the second shape"]
    pub shapeIdB: b2ShapeId,
    #[doc = " Point where the shapes hit at the beginning of the time step.\n This is a mid-point between the two surfaces. It could be at speculative\n point where the two shapes were not touching at the beginning of the time step."]
    pub point: b2Vec2,
    #[doc = " Normal vector pointing from shape A to shape B"]
    pub normal: b2Vec2,
    #[doc = " The speed the shapes are approaching. Always positive. Typically in meters per second."]
    pub approachSpeed: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ContactHitEvent"][::std::mem::size_of::<b2ContactHitEvent>() - 36usize];
    ["Alignment of b2ContactHitEvent"][::std::mem::align_of::<b2ContactHitEvent>() - 4usize];
    ["Offset of field: b2ContactHitEvent::shapeIdA"][::std::mem::offset_of!(b2ContactHitEvent, shapeIdA) - 0usize];
    ["Offset of field: b2ContactHitEvent::shapeIdB"][::std::mem::offset_of!(b2ContactHitEvent, shapeIdB) - 8usize];
    ["Offset of field: b2ContactHitEvent::point"][::std::mem::offset_of!(b2ContactHitEvent, point) - 16usize];
    ["Offset of field: b2ContactHitEvent::normal"][::std::mem::offset_of!(b2ContactHitEvent, normal) - 24usize];
    ["Offset of field: b2ContactHitEvent::approachSpeed"]
        [::std::mem::offset_of!(b2ContactHitEvent, approachSpeed) - 32usize];
};
#[doc = " Contact events are buffered in the Box2D world and are available\n as event arrays after the time step is complete.\n Note: these may become invalid if bodies and/or shapes are destroyed"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ContactEvents {
    #[doc = " Array of begin touch events"]
    pub beginEvents: *mut b2ContactBeginTouchEvent,
    #[doc = " Array of end touch events"]
    pub endEvents: *mut b2ContactEndTouchEvent,
    #[doc = " Array of hit events"]
    pub hitEvents: *mut b2ContactHitEvent,
    #[doc = " Number of begin touch events"]
    pub beginCount: ::std::os::raw::c_int,
    #[doc = " Number of end touch events"]
    pub endCount: ::std::os::raw::c_int,
    #[doc = " Number of hit events"]
    pub hitCount: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ContactEvents"][::std::mem::size_of::<b2ContactEvents>() - 40usize];
    ["Alignment of b2ContactEvents"][::std::mem::align_of::<b2ContactEvents>() - 8usize];
    ["Offset of field: b2ContactEvents::beginEvents"][::std::mem::offset_of!(b2ContactEvents, beginEvents) - 0usize];
    ["Offset of field: b2ContactEvents::endEvents"][::std::mem::offset_of!(b2ContactEvents, endEvents) - 8usize];
    ["Offset of field: b2ContactEvents::hitEvents"][::std::mem::offset_of!(b2ContactEvents, hitEvents) - 16usize];
    ["Offset of field: b2ContactEvents::beginCount"][::std::mem::offset_of!(b2ContactEvents, beginCount) - 24usize];
    ["Offset of field: b2ContactEvents::endCount"][::std::mem::offset_of!(b2ContactEvents, endCount) - 28usize];
    ["Offset of field: b2ContactEvents::hitCount"][::std::mem::offset_of!(b2ContactEvents, hitCount) - 32usize];
};
#[doc = " Body move events triggered when a body moves.\n Triggered when a body moves due to simulation. Not reported for bodies moved by the user.\n This also has a flag to indicate that the body went to sleep so the application can also\n sleep that actor/entity/object associated with the body.\n On the other hand if the flag does not indicate the body went to sleep then the application\n can treat the actor/entity/object associated with the body as awake.\n This is an efficient way for an application to update game object transforms rather than\n calling functions such as b2Body_GetTransform() because this data is delivered as a contiguous array\n and it is only populated with bodies that have moved.\n @note If sleeping is disabled all dynamic and kinematic bodies will trigger move events."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2BodyMoveEvent {
    pub userData: *mut ::std::os::raw::c_void,
    pub transform: b2Transform,
    pub bodyId: b2BodyId,
    pub fellAsleep: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2BodyMoveEvent"][::std::mem::size_of::<b2BodyMoveEvent>() - 40usize];
    ["Alignment of b2BodyMoveEvent"][::std::mem::align_of::<b2BodyMoveEvent>() - 8usize];
    ["Offset of field: b2BodyMoveEvent::userData"][::std::mem::offset_of!(b2BodyMoveEvent, userData) - 0usize];
    ["Offset of field: b2BodyMoveEvent::transform"][::std::mem::offset_of!(b2BodyMoveEvent, transform) - 8usize];
    ["Offset of field: b2BodyMoveEvent::bodyId"][::std::mem::offset_of!(b2BodyMoveEvent, bodyId) - 24usize];
    ["Offset of field: b2BodyMoveEvent::fellAsleep"][::std::mem::offset_of!(b2BodyMoveEvent, fellAsleep) - 32usize];
};
#[doc = " Body events are buffered in the Box2D world and are available\n as event arrays after the time step is complete.\n Note: this data becomes invalid if bodies are destroyed"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2BodyEvents {
    #[doc = " Array of move events"]
    pub moveEvents: *mut b2BodyMoveEvent,
    #[doc = " Number of move events"]
    pub moveCount: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2BodyEvents"][::std::mem::size_of::<b2BodyEvents>() - 16usize];
    ["Alignment of b2BodyEvents"][::std::mem::align_of::<b2BodyEvents>() - 8usize];
    ["Offset of field: b2BodyEvents::moveEvents"][::std::mem::offset_of!(b2BodyEvents, moveEvents) - 0usize];
    ["Offset of field: b2BodyEvents::moveCount"][::std::mem::offset_of!(b2BodyEvents, moveCount) - 8usize];
};
#[doc = " Joint events report joints that are awake and have a force and/or torque exceeding the threshold\n The observed forces and torques are not returned for efficiency reasons."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2JointEvent {
    #[doc = " The joint id"]
    pub jointId: b2JointId,
    #[doc = " The user data from the joint for convenience"]
    pub userData: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2JointEvent"][::std::mem::size_of::<b2JointEvent>() - 16usize];
    ["Alignment of b2JointEvent"][::std::mem::align_of::<b2JointEvent>() - 8usize];
    ["Offset of field: b2JointEvent::jointId"][::std::mem::offset_of!(b2JointEvent, jointId) - 0usize];
    ["Offset of field: b2JointEvent::userData"][::std::mem::offset_of!(b2JointEvent, userData) - 8usize];
};
#[doc = " Joint events are buffered in the world and are available\n as event arrays after the time step is complete.\n Note: this data becomes invalid if joints are destroyed"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2JointEvents {
    #[doc = " Array of events"]
    pub jointEvents: *mut b2JointEvent,
    #[doc = " Number of events"]
    pub count: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2JointEvents"][::std::mem::size_of::<b2JointEvents>() - 16usize];
    ["Alignment of b2JointEvents"][::std::mem::align_of::<b2JointEvents>() - 8usize];
    ["Offset of field: b2JointEvents::jointEvents"][::std::mem::offset_of!(b2JointEvents, jointEvents) - 0usize];
    ["Offset of field: b2JointEvents::count"][::std::mem::offset_of!(b2JointEvents, count) - 8usize];
};
#[doc = " The contact data for two shapes. By convention the manifold normal points\n from shape A to shape B.\n @see b2Shape_GetContactData() and b2Body_GetContactData()"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2ContactData {
    pub contactId: b2ContactId,
    pub shapeIdA: b2ShapeId,
    pub shapeIdB: b2ShapeId,
    pub manifold: b2Manifold,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2ContactData"][::std::mem::size_of::<b2ContactData>() - 140usize];
    ["Alignment of b2ContactData"][::std::mem::align_of::<b2ContactData>() - 4usize];
    ["Offset of field: b2ContactData::contactId"][::std::mem::offset_of!(b2ContactData, contactId) - 0usize];
    ["Offset of field: b2ContactData::shapeIdA"][::std::mem::offset_of!(b2ContactData, shapeIdA) - 12usize];
    ["Offset of field: b2ContactData::shapeIdB"][::std::mem::offset_of!(b2ContactData, shapeIdB) - 20usize];
    ["Offset of field: b2ContactData::manifold"][::std::mem::offset_of!(b2ContactData, manifold) - 28usize];
};
#[doc = " Prototype for a contact filter callback.\n This is called when a contact pair is considered for collision. This allows you to\n perform custom logic to prevent collision between shapes. This is only called if\n one of the two shapes has custom filtering enabled.\n Notes:\n - this function must be thread-safe\n - this is only called if one of the two shapes has enabled custom filtering\n - this may be called for awake dynamic bodies and sensors\n Return false if you want to disable the collision\n @see b2ShapeDef\n @warning Do not attempt to modify the world inside this callback\n @ingroup world"]
pub type b2CustomFilterFcn = ::std::option::Option<
    unsafe extern "C" fn(shapeIdA: b2ShapeId, shapeIdB: b2ShapeId, context: *mut ::std::os::raw::c_void) -> bool,
>;
#[doc = " Prototype for a pre-solve callback.\n This is called after a contact is updated. This allows you to inspect a\n contact before it goes to the solver. If you are careful, you can modify the\n contact manifold (e.g. modify the normal).\n Notes:\n - this function must be thread-safe\n - this is only called if the shape has enabled pre-solve events\n - this is called only for awake dynamic bodies\n - this is not called for sensors\n - the supplied manifold has impulse values from the previous step\n Return false if you want to disable the contact this step\n @warning Do not attempt to modify the world inside this callback\n @ingroup world"]
pub type b2PreSolveFcn = ::std::option::Option<
    unsafe extern "C" fn(
        shapeIdA: b2ShapeId,
        shapeIdB: b2ShapeId,
        point: b2Vec2,
        normal: b2Vec2,
        context: *mut ::std::os::raw::c_void,
    ) -> bool,
>;
#[doc = " Prototype callback for overlap queries.\n Called for each shape found in the query.\n @see b2World_OverlapABB\n @return false to terminate the query.\n @ingroup world"]
pub type b2OverlapResultFcn =
    ::std::option::Option<unsafe extern "C" fn(shapeId: b2ShapeId, context: *mut ::std::os::raw::c_void) -> bool>;
#[doc = " Prototype callback for ray and shape casts.\n Called for each shape found in the query. You control how the ray cast\n proceeds by returning a float:\n return -1: ignore this shape and continue\n return 0: terminate the ray cast\n return fraction: clip the ray to this point\n return 1: don't clip the ray and continue\n A cast with initial overlap will return a zero fraction and a zero normal.\n @param shapeId the shape hit by the ray\n @param point the point of initial intersection\n @param normal the normal vector at the point of intersection, zero for a shape cast with initial overlap\n @param fraction the fraction along the ray at the point of intersection, zero for a shape cast with initial overlap\n @param context the user context\n @return -1 to filter, 0 to terminate, fraction to clip the ray for closest hit, 1 to continue\n @see b2World_CastRay\n @ingroup world"]
pub type b2CastResultFcn = ::std::option::Option<
    unsafe extern "C" fn(
        shapeId: b2ShapeId,
        point: b2Vec2,
        normal: b2Vec2,
        fraction: f32,
        context: *mut ::std::os::raw::c_void,
    ) -> f32,
>;
pub type b2PlaneResultFcn = ::std::option::Option<
    unsafe extern "C" fn(shapeId: b2ShapeId, plane: *const b2PlaneResult, context: *mut ::std::os::raw::c_void) -> bool,
>;
pub const b2HexColor_b2_colorAliceBlue: b2HexColor = 15792383;
pub const b2HexColor_b2_colorAntiqueWhite: b2HexColor = 16444375;
pub const b2HexColor_b2_colorAqua: b2HexColor = 65535;
pub const b2HexColor_b2_colorAquamarine: b2HexColor = 8388564;
pub const b2HexColor_b2_colorAzure: b2HexColor = 15794175;
pub const b2HexColor_b2_colorBeige: b2HexColor = 16119260;
pub const b2HexColor_b2_colorBisque: b2HexColor = 16770244;
pub const b2HexColor_b2_colorBlack: b2HexColor = 0;
pub const b2HexColor_b2_colorBlanchedAlmond: b2HexColor = 16772045;
pub const b2HexColor_b2_colorBlue: b2HexColor = 255;
pub const b2HexColor_b2_colorBlueViolet: b2HexColor = 9055202;
pub const b2HexColor_b2_colorBrown: b2HexColor = 10824234;
pub const b2HexColor_b2_colorBurlywood: b2HexColor = 14596231;
pub const b2HexColor_b2_colorCadetBlue: b2HexColor = 6266528;
pub const b2HexColor_b2_colorChartreuse: b2HexColor = 8388352;
pub const b2HexColor_b2_colorChocolate: b2HexColor = 13789470;
pub const b2HexColor_b2_colorCoral: b2HexColor = 16744272;
pub const b2HexColor_b2_colorCornflowerBlue: b2HexColor = 6591981;
pub const b2HexColor_b2_colorCornsilk: b2HexColor = 16775388;
pub const b2HexColor_b2_colorCrimson: b2HexColor = 14423100;
pub const b2HexColor_b2_colorCyan: b2HexColor = 65535;
pub const b2HexColor_b2_colorDarkBlue: b2HexColor = 139;
pub const b2HexColor_b2_colorDarkCyan: b2HexColor = 35723;
pub const b2HexColor_b2_colorDarkGoldenRod: b2HexColor = 12092939;
pub const b2HexColor_b2_colorDarkGray: b2HexColor = 11119017;
pub const b2HexColor_b2_colorDarkGreen: b2HexColor = 25600;
pub const b2HexColor_b2_colorDarkKhaki: b2HexColor = 12433259;
pub const b2HexColor_b2_colorDarkMagenta: b2HexColor = 9109643;
pub const b2HexColor_b2_colorDarkOliveGreen: b2HexColor = 5597999;
pub const b2HexColor_b2_colorDarkOrange: b2HexColor = 16747520;
pub const b2HexColor_b2_colorDarkOrchid: b2HexColor = 10040012;
pub const b2HexColor_b2_colorDarkRed: b2HexColor = 9109504;
pub const b2HexColor_b2_colorDarkSalmon: b2HexColor = 15308410;
pub const b2HexColor_b2_colorDarkSeaGreen: b2HexColor = 9419919;
pub const b2HexColor_b2_colorDarkSlateBlue: b2HexColor = 4734347;
pub const b2HexColor_b2_colorDarkSlateGray: b2HexColor = 3100495;
pub const b2HexColor_b2_colorDarkTurquoise: b2HexColor = 52945;
pub const b2HexColor_b2_colorDarkViolet: b2HexColor = 9699539;
pub const b2HexColor_b2_colorDeepPink: b2HexColor = 16716947;
pub const b2HexColor_b2_colorDeepSkyBlue: b2HexColor = 49151;
pub const b2HexColor_b2_colorDimGray: b2HexColor = 6908265;
pub const b2HexColor_b2_colorDodgerBlue: b2HexColor = 2003199;
pub const b2HexColor_b2_colorFireBrick: b2HexColor = 11674146;
pub const b2HexColor_b2_colorFloralWhite: b2HexColor = 16775920;
pub const b2HexColor_b2_colorForestGreen: b2HexColor = 2263842;
pub const b2HexColor_b2_colorFuchsia: b2HexColor = 16711935;
pub const b2HexColor_b2_colorGainsboro: b2HexColor = 14474460;
pub const b2HexColor_b2_colorGhostWhite: b2HexColor = 16316671;
pub const b2HexColor_b2_colorGold: b2HexColor = 16766720;
pub const b2HexColor_b2_colorGoldenRod: b2HexColor = 14329120;
pub const b2HexColor_b2_colorGray: b2HexColor = 8421504;
pub const b2HexColor_b2_colorGreen: b2HexColor = 32768;
pub const b2HexColor_b2_colorGreenYellow: b2HexColor = 11403055;
pub const b2HexColor_b2_colorHoneyDew: b2HexColor = 15794160;
pub const b2HexColor_b2_colorHotPink: b2HexColor = 16738740;
pub const b2HexColor_b2_colorIndianRed: b2HexColor = 13458524;
pub const b2HexColor_b2_colorIndigo: b2HexColor = 4915330;
pub const b2HexColor_b2_colorIvory: b2HexColor = 16777200;
pub const b2HexColor_b2_colorKhaki: b2HexColor = 15787660;
pub const b2HexColor_b2_colorLavender: b2HexColor = 15132410;
pub const b2HexColor_b2_colorLavenderBlush: b2HexColor = 16773365;
pub const b2HexColor_b2_colorLawnGreen: b2HexColor = 8190976;
pub const b2HexColor_b2_colorLemonChiffon: b2HexColor = 16775885;
pub const b2HexColor_b2_colorLightBlue: b2HexColor = 11393254;
pub const b2HexColor_b2_colorLightCoral: b2HexColor = 15761536;
pub const b2HexColor_b2_colorLightCyan: b2HexColor = 14745599;
pub const b2HexColor_b2_colorLightGoldenRodYellow: b2HexColor = 16448210;
pub const b2HexColor_b2_colorLightGray: b2HexColor = 13882323;
pub const b2HexColor_b2_colorLightGreen: b2HexColor = 9498256;
pub const b2HexColor_b2_colorLightPink: b2HexColor = 16758465;
pub const b2HexColor_b2_colorLightSalmon: b2HexColor = 16752762;
pub const b2HexColor_b2_colorLightSeaGreen: b2HexColor = 2142890;
pub const b2HexColor_b2_colorLightSkyBlue: b2HexColor = 8900346;
pub const b2HexColor_b2_colorLightSlateGray: b2HexColor = 7833753;
pub const b2HexColor_b2_colorLightSteelBlue: b2HexColor = 11584734;
pub const b2HexColor_b2_colorLightYellow: b2HexColor = 16777184;
pub const b2HexColor_b2_colorLime: b2HexColor = 65280;
pub const b2HexColor_b2_colorLimeGreen: b2HexColor = 3329330;
pub const b2HexColor_b2_colorLinen: b2HexColor = 16445670;
pub const b2HexColor_b2_colorMagenta: b2HexColor = 16711935;
pub const b2HexColor_b2_colorMaroon: b2HexColor = 8388608;
pub const b2HexColor_b2_colorMediumAquaMarine: b2HexColor = 6737322;
pub const b2HexColor_b2_colorMediumBlue: b2HexColor = 205;
pub const b2HexColor_b2_colorMediumOrchid: b2HexColor = 12211667;
pub const b2HexColor_b2_colorMediumPurple: b2HexColor = 9662683;
pub const b2HexColor_b2_colorMediumSeaGreen: b2HexColor = 3978097;
pub const b2HexColor_b2_colorMediumSlateBlue: b2HexColor = 8087790;
pub const b2HexColor_b2_colorMediumSpringGreen: b2HexColor = 64154;
pub const b2HexColor_b2_colorMediumTurquoise: b2HexColor = 4772300;
pub const b2HexColor_b2_colorMediumVioletRed: b2HexColor = 13047173;
pub const b2HexColor_b2_colorMidnightBlue: b2HexColor = 1644912;
pub const b2HexColor_b2_colorMintCream: b2HexColor = 16121850;
pub const b2HexColor_b2_colorMistyRose: b2HexColor = 16770273;
pub const b2HexColor_b2_colorMoccasin: b2HexColor = 16770229;
pub const b2HexColor_b2_colorNavajoWhite: b2HexColor = 16768685;
pub const b2HexColor_b2_colorNavy: b2HexColor = 128;
pub const b2HexColor_b2_colorOldLace: b2HexColor = 16643558;
pub const b2HexColor_b2_colorOlive: b2HexColor = 8421376;
pub const b2HexColor_b2_colorOliveDrab: b2HexColor = 7048739;
pub const b2HexColor_b2_colorOrange: b2HexColor = 16753920;
pub const b2HexColor_b2_colorOrangeRed: b2HexColor = 16729344;
pub const b2HexColor_b2_colorOrchid: b2HexColor = 14315734;
pub const b2HexColor_b2_colorPaleGoldenRod: b2HexColor = 15657130;
pub const b2HexColor_b2_colorPaleGreen: b2HexColor = 10025880;
pub const b2HexColor_b2_colorPaleTurquoise: b2HexColor = 11529966;
pub const b2HexColor_b2_colorPaleVioletRed: b2HexColor = 14381203;
pub const b2HexColor_b2_colorPapayaWhip: b2HexColor = 16773077;
pub const b2HexColor_b2_colorPeachPuff: b2HexColor = 16767673;
pub const b2HexColor_b2_colorPeru: b2HexColor = 13468991;
pub const b2HexColor_b2_colorPink: b2HexColor = 16761035;
pub const b2HexColor_b2_colorPlum: b2HexColor = 14524637;
pub const b2HexColor_b2_colorPowderBlue: b2HexColor = 11591910;
pub const b2HexColor_b2_colorPurple: b2HexColor = 8388736;
pub const b2HexColor_b2_colorRebeccaPurple: b2HexColor = 6697881;
pub const b2HexColor_b2_colorRed: b2HexColor = 16711680;
pub const b2HexColor_b2_colorRosyBrown: b2HexColor = 12357519;
pub const b2HexColor_b2_colorRoyalBlue: b2HexColor = 4286945;
pub const b2HexColor_b2_colorSaddleBrown: b2HexColor = 9127187;
pub const b2HexColor_b2_colorSalmon: b2HexColor = 16416882;
pub const b2HexColor_b2_colorSandyBrown: b2HexColor = 16032864;
pub const b2HexColor_b2_colorSeaGreen: b2HexColor = 3050327;
pub const b2HexColor_b2_colorSeaShell: b2HexColor = 16774638;
pub const b2HexColor_b2_colorSienna: b2HexColor = 10506797;
pub const b2HexColor_b2_colorSilver: b2HexColor = 12632256;
pub const b2HexColor_b2_colorSkyBlue: b2HexColor = 8900331;
pub const b2HexColor_b2_colorSlateBlue: b2HexColor = 6970061;
pub const b2HexColor_b2_colorSlateGray: b2HexColor = 7372944;
pub const b2HexColor_b2_colorSnow: b2HexColor = 16775930;
pub const b2HexColor_b2_colorSpringGreen: b2HexColor = 65407;
pub const b2HexColor_b2_colorSteelBlue: b2HexColor = 4620980;
pub const b2HexColor_b2_colorTan: b2HexColor = 13808780;
pub const b2HexColor_b2_colorTeal: b2HexColor = 32896;
pub const b2HexColor_b2_colorThistle: b2HexColor = 14204888;
pub const b2HexColor_b2_colorTomato: b2HexColor = 16737095;
pub const b2HexColor_b2_colorTurquoise: b2HexColor = 4251856;
pub const b2HexColor_b2_colorViolet: b2HexColor = 15631086;
pub const b2HexColor_b2_colorWheat: b2HexColor = 16113331;
pub const b2HexColor_b2_colorWhite: b2HexColor = 16777215;
pub const b2HexColor_b2_colorWhiteSmoke: b2HexColor = 16119285;
pub const b2HexColor_b2_colorYellow: b2HexColor = 16776960;
pub const b2HexColor_b2_colorYellowGreen: b2HexColor = 10145074;
pub const b2HexColor_b2_colorBox2DRed: b2HexColor = 14430514;
pub const b2HexColor_b2_colorBox2DBlue: b2HexColor = 3190463;
pub const b2HexColor_b2_colorBox2DGreen: b2HexColor = 9226532;
pub const b2HexColor_b2_colorBox2DYellow: b2HexColor = 16772748;
#[doc = " These colors are used for debug draw and mostly match the named SVG colors.\n See https://www.rapidtables.com/web/color/index.html\n https://johndecember.com/html/spec/colorsvg.html\n https://upload.wikimedia.org/wikipedia/commons/2/2b/SVG_Recognized_color_keyword_names.svg"]
pub type b2HexColor = ::std::os::raw::c_uint;
#[doc = " This struct holds callbacks you can implement to draw a Box2D world.\n This structure should be zero initialized.\n @ingroup world"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2DebugDraw {
    #[doc = " Draw a closed polygon provided in CCW order."]
    pub DrawPolygonFcn: ::std::option::Option<
        unsafe extern "C" fn(
            vertices: *const b2Vec2,
            vertexCount: ::std::os::raw::c_int,
            color: b2HexColor,
            context: *mut ::std::os::raw::c_void,
        ),
    >,
    #[doc = " Draw a solid closed polygon provided in CCW order."]
    pub DrawSolidPolygonFcn: ::std::option::Option<
        unsafe extern "C" fn(
            transform: b2Transform,
            vertices: *const b2Vec2,
            vertexCount: ::std::os::raw::c_int,
            radius: f32,
            color: b2HexColor,
            context: *mut ::std::os::raw::c_void,
        ),
    >,
    #[doc = " Draw a circle."]
    pub DrawCircleFcn: ::std::option::Option<
        unsafe extern "C" fn(center: b2Vec2, radius: f32, color: b2HexColor, context: *mut ::std::os::raw::c_void),
    >,
    #[doc = " Draw a solid circle."]
    pub DrawSolidCircleFcn: ::std::option::Option<
        unsafe extern "C" fn(
            transform: b2Transform,
            radius: f32,
            color: b2HexColor,
            context: *mut ::std::os::raw::c_void,
        ),
    >,
    #[doc = " Draw a solid capsule."]
    pub DrawSolidCapsuleFcn: ::std::option::Option<
        unsafe extern "C" fn(
            p1: b2Vec2,
            p2: b2Vec2,
            radius: f32,
            color: b2HexColor,
            context: *mut ::std::os::raw::c_void,
        ),
    >,
    #[doc = " Draw a line segment."]
    pub DrawSegmentFcn: ::std::option::Option<
        unsafe extern "C" fn(p1: b2Vec2, p2: b2Vec2, color: b2HexColor, context: *mut ::std::os::raw::c_void),
    >,
    #[doc = " Draw a transform. Choose your own length scale."]
    pub DrawTransformFcn:
        ::std::option::Option<unsafe extern "C" fn(transform: b2Transform, context: *mut ::std::os::raw::c_void)>,
    #[doc = " Draw a point."]
    pub DrawPointFcn: ::std::option::Option<
        unsafe extern "C" fn(p: b2Vec2, size: f32, color: b2HexColor, context: *mut ::std::os::raw::c_void),
    >,
    #[doc = " Draw a string in world space"]
    pub DrawStringFcn: ::std::option::Option<
        unsafe extern "C" fn(
            p: b2Vec2,
            s: *const ::std::os::raw::c_char,
            color: b2HexColor,
            context: *mut ::std::os::raw::c_void,
        ),
    >,
    #[doc = " Bounds to use if restricting drawing to a rectangular region"]
    pub drawingBounds: b2AABB,
    #[doc = " Option to draw shapes"]
    pub drawShapes: bool,
    #[doc = " Option to draw joints"]
    pub drawJoints: bool,
    #[doc = " Option to draw additional information for joints"]
    pub drawJointExtras: bool,
    #[doc = " Option to draw the bounding boxes for shapes"]
    pub drawBounds: bool,
    #[doc = " Option to draw the mass and center of mass of dynamic bodies"]
    pub drawMass: bool,
    #[doc = " Option to draw body names"]
    pub drawBodyNames: bool,
    #[doc = " Option to draw contact points"]
    pub drawContacts: bool,
    #[doc = " Option to visualize the graph coloring used for contacts and joints"]
    pub drawGraphColors: bool,
    #[doc = " Option to draw contact normals"]
    pub drawContactNormals: bool,
    #[doc = " Option to draw contact normal impulses"]
    pub drawContactImpulses: bool,
    #[doc = " Option to draw contact feature ids"]
    pub drawContactFeatures: bool,
    #[doc = " Option to draw contact friction impulses"]
    pub drawFrictionImpulses: bool,
    #[doc = " Option to draw islands as bounding boxes"]
    pub drawIslands: bool,
    #[doc = " User context that is passed as an argument to drawing callback functions"]
    pub context: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of b2DebugDraw"][::std::mem::size_of::<b2DebugDraw>() - 112usize];
    ["Alignment of b2DebugDraw"][::std::mem::align_of::<b2DebugDraw>() - 8usize];
    ["Offset of field: b2DebugDraw::DrawPolygonFcn"][::std::mem::offset_of!(b2DebugDraw, DrawPolygonFcn) - 0usize];
    ["Offset of field: b2DebugDraw::DrawSolidPolygonFcn"]
        [::std::mem::offset_of!(b2DebugDraw, DrawSolidPolygonFcn) - 8usize];
    ["Offset of field: b2DebugDraw::DrawCircleFcn"][::std::mem::offset_of!(b2DebugDraw, DrawCircleFcn) - 16usize];
    ["Offset of field: b2DebugDraw::DrawSolidCircleFcn"]
        [::std::mem::offset_of!(b2DebugDraw, DrawSolidCircleFcn) - 24usize];
    ["Offset of field: b2DebugDraw::DrawSolidCapsuleFcn"]
        [::std::mem::offset_of!(b2DebugDraw, DrawSolidCapsuleFcn) - 32usize];
    ["Offset of field: b2DebugDraw::DrawSegmentFcn"][::std::mem::offset_of!(b2DebugDraw, DrawSegmentFcn) - 40usize];
    ["Offset of field: b2DebugDraw::DrawTransformFcn"][::std::mem::offset_of!(b2DebugDraw, DrawTransformFcn) - 48usize];
    ["Offset of field: b2DebugDraw::DrawPointFcn"][::std::mem::offset_of!(b2DebugDraw, DrawPointFcn) - 56usize];
    ["Offset of field: b2DebugDraw::DrawStringFcn"][::std::mem::offset_of!(b2DebugDraw, DrawStringFcn) - 64usize];
    ["Offset of field: b2DebugDraw::drawingBounds"][::std::mem::offset_of!(b2DebugDraw, drawingBounds) - 72usize];
    ["Offset of field: b2DebugDraw::drawShapes"][::std::mem::offset_of!(b2DebugDraw, drawShapes) - 88usize];
    ["Offset of field: b2DebugDraw::drawJoints"][::std::mem::offset_of!(b2DebugDraw, drawJoints) - 89usize];
    ["Offset of field: b2DebugDraw::drawJointExtras"][::std::mem::offset_of!(b2DebugDraw, drawJointExtras) - 90usize];
    ["Offset of field: b2DebugDraw::drawBounds"][::std::mem::offset_of!(b2DebugDraw, drawBounds) - 91usize];
    ["Offset of field: b2DebugDraw::drawMass"][::std::mem::offset_of!(b2DebugDraw, drawMass) - 92usize];
    ["Offset of field: b2DebugDraw::drawBodyNames"][::std::mem::offset_of!(b2DebugDraw, drawBodyNames) - 93usize];
    ["Offset of field: b2DebugDraw::drawContacts"][::std::mem::offset_of!(b2DebugDraw, drawContacts) - 94usize];
    ["Offset of field: b2DebugDraw::drawGraphColors"][::std::mem::offset_of!(b2DebugDraw, drawGraphColors) - 95usize];
    ["Offset of field: b2DebugDraw::drawContactNormals"]
        [::std::mem::offset_of!(b2DebugDraw, drawContactNormals) - 96usize];
    ["Offset of field: b2DebugDraw::drawContactImpulses"]
        [::std::mem::offset_of!(b2DebugDraw, drawContactImpulses) - 97usize];
    ["Offset of field: b2DebugDraw::drawContactFeatures"]
        [::std::mem::offset_of!(b2DebugDraw, drawContactFeatures) - 98usize];
    ["Offset of field: b2DebugDraw::drawFrictionImpulses"]
        [::std::mem::offset_of!(b2DebugDraw, drawFrictionImpulses) - 99usize];
    ["Offset of field: b2DebugDraw::drawIslands"][::std::mem::offset_of!(b2DebugDraw, drawIslands) - 100usize];
    ["Offset of field: b2DebugDraw::context"][::std::mem::offset_of!(b2DebugDraw, context) - 104usize];
};
#[doc = " The tree nodes"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct b2TreeNode {
    pub _address: u8,
}
unsafe extern "C" {
    #[doc = " This allows the user to override the allocation functions. These should be\n set during application startup."]
    pub fn b2SetAllocator(allocFcn: b2AllocFcn, freeFcn: b2FreeFcn);
    #[doc = " @return the total bytes allocated by Box2D"]
    pub fn b2GetByteCount() -> ::std::os::raw::c_int;
    #[doc = " Override the default assert callback\n @param assertFcn a non-null assert callback"]
    pub fn b2SetAssertFcn(assertFcn: b2AssertFcn);
    #[doc = " Get the current version of Box2D"]
    pub fn b2GetVersion() -> b2Version;
    pub fn b2InternalAssertFcn(
        condition: *const ::std::os::raw::c_char,
        fileName: *const ::std::os::raw::c_char,
        lineNumber: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
